{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Orange Jelly - Pub Marketing & Business Growth",
  "description": "Expert pub marketing strategies, business growth tips, and practical advice for UK publicans. From empty pub solutions to premium positioning.",
  "home_page_url": "https://www.orangejelly.co.uk",
  "feed_url": "https://www.orangejelly.co.uk/feed.json",
  "language": "en-GB",
  "author": {
    "name": "Peter Pitcher",
    "email": "peter@orangejelly.co.uk"
  },
  "icon": "https://www.orangejelly.co.uk/icon-512.png",
  "favicon": "https://www.orangejelly.co.uk/favicon.ico",
  "items": [
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/summer-moments-simple-campaigns",
      "url": "https://www.orangejelly.co.uk/licensees-guide/summer-moments-simple-campaigns",
      "title": "Summer Moments, Simple Campaigns: an inspiring idea bank for pub teams (May to Aug)",
      "content_html": "\nSummer is not one long season. It is a chain of moments.\n\nA long weekend where the town feels lighter. A sunny Friday when everyone wants to be out. A family Sunday that needs to feel worth leaving the sofa for. A couple of cultural fixtures that make people dress a little brighter. A sudden craving for something cold, crisp, fruity, or sparkling.\n\nThe pubs that win summer do not necessarily do the biggest things. They do the clearest things.\n\nThey give people a reason to choose them, today, with an experience that feels effortless to join and simple to deliver. This page is designed to help you do exactly that: a big, inspiring bank of formats, twists, prompts, and thought starters you can turn into your own plug-and-play calendar.\n\nYou do not need perfection. You need momentum.\n\n## The summer mindset: build moments, not “events”\n\nBefore the ideas, here is the mindset that makes them work.\n\n### 1) One promise beats ten activities\n\nA busy poster is not a strategy. Pick one headline reason to visit and make everything else support it.\n\nExamples of clear promises:\n\n* “A proper garden party weekend”\n* “The best Sunday for Dad”\n* “A cider mini-festival, no ticket required”\n* “Premium summer afternoons, dress-up optional”\n* “A wine night anyone can enjoy”\n\n### 2) Make it easy to join in\n\nIf guests need instructions, it is too complicated. Design for walk-ins and first-timers.\n\nAsk:\n\n* Can someone arrive at any time and still feel included?\n* Can the idea be explained in one sentence by a team member?\n* Does it work if the weather changes?\n\n### 3) Create theatre with simple signals\n\nYou are not competing with other pubs. You are competing with staying home.\n\nThe easiest way to feel special is to look special:\n\n* a chalkboard headline\n* bunting, florals, or a single themed table runner\n* a “today only” menu insert\n* a small tasting card or stamp card\n* one photogenic serve that becomes the poster image\n\n### 4) Build in a “second round” and a “second reason”\n\nEvery strong activation has:\n\n* **a second round trigger** (a flight, a top-up, a special garnish, a jug-for-the-table)\n* **a second reason** (food pairing, a prize draw, a vote, a photo moment)\n\n### 5) Include everyone\n\nSummer footfall includes families, older guests, groups, and people pacing themselves.\n\nEvery activation is stronger with:\n\n* a low and no option\n* good water availability\n* a food-led anchor\n\nKeep it welcoming. Keep it generous.\n\n---\n\n## A plug-and-play summer framework you can reuse all season\n\nWhen you want to spin up an idea quickly, use this template.\n\n### The 4-part activation formula\n\n1. **Moment**: what are people already thinking about?\n2. **Hook**: what is the simplest reason to choose you?\n3. **Ritual**: what do guests physically do that feels like “being part of it”?\n4. **Upsell**: what add-on naturally fits, without feeling pushy?\n\nExample:\n\n* Moment: Bank Holiday Saturday\n* Hook: “Garden Party Weekend”\n* Ritual: vote for the song of the summer, grab a stamp card, join a quick team game\n* Upsell: sharer boards + jug serve + dessert special\n\n---\n\n## Bank Holiday weekends: simple formats that work in most pubs\n\nBank Holiday weekends are not one big day. They are three separate opportunities:\n\n* **Friday night**: permission to start the weekend\n* **Saturday**: the main event\n* **Sunday/Monday**: families, recovery, and “one more visit”\n\nInstead of trying to do everything, pick a format and let it run across the weekend.\n\n### Format 1: The Garden Party Weekend\n\n![Garden Party Setup](/images/blog/garden-party.png)\n\nThe energy: bright, relaxed, sociable.\n\n**Simple ingredients**\n\n* A headline serve (spritz-style, summer cup, bottled specials, or a hero cocktail)\n* A sharer menu (BBQ boards, flatbreads, “garden bites”)\n* One light activity (giant games, pub Olympics, playlist vote)\n\n**Thought starters**\n\n* “Sun’s out guarantee”: if it rains, the offer becomes an indoor comfort version (hot puddings, cosy cocktails, roast specials)\n* Create a “Garden Party Passport” with 3 stamps: drink, food, photo. Complete it for a small prize\n* A two-hour “Golden Hour” window with one hero serve and a soundtrack\n\n**Make it feel premium without extra work**\n\n* Pre-set a few tables with simple centrepieces\n* Serve your hero drink in one signature glassware style and garnish\n* Use one consistent colour theme (even just via posters and menus)\n\n### Format 2: The Big Bank Holiday Quiz, but upgraded\n\nQuizzes are familiar. The upgrade is what makes it shareable.\n\n**Easy upgrades**\n\n* Speed rounds: 60-second themed bursts\n* “Table challenges”: mini tasks between rounds (no mess, no stress)\n* Mystery prizes that are funny rather than expensive\n\n**Themes that suit summer**\n\n* “Holiday Anthems”\n* “Summer of…” (choose a decade)\n* “Local Legends”\n* “The Great British Picnic”\n* “Wimbledon warm-up” or “Royal Ascot style special”\n\n**A walk-in friendly twist**\nRun a drop-in version where teams can join any time and still win something (spot prizes, raffle tickets per correct answer).\n\n### Format 3: Live music, but with a story\n\nNot “live music”, but a named moment.\n\nExamples:\n\n* “Saturday Sundown Sessions”\n* “Acoustic Garden Hours”\n* “The After-Sun Social”\n* “Singalong Sundays”\n\n**Thought starters**\n\n* Give guests a request card on the table\n* “Choose the encore”: the room votes\n* Pair the set with a “supporting menu” that is designed for one-handed eating\n\n### Format 4: Community Weekend\n\nThis one builds loyalty, not just sales.\n\n**Ideas**\n\n* Partner with a local cause for a simple raffle\n* Host a “local makers table” (zero complexity: one small stall, one time window)\n* Run a family hour with easy games and a kids menu highlight\n* “Bring a neighbour”: reward tables of mixed groups\n\n**Why it works**\nPeople love a pub that feels like the heart of the area. Summer is when they notice it most.\n\n### Format 5: The Bank Holiday “Mini-Festival”\n\nIf you like the Cider Weekender concept, you can run the same structure for a broader weekend.\n\n**Mini-festival building blocks**\n\n* a tasting flight or discovery board\n* a passport or stamp card\n* a vote or leaderboard\n* a Sunday “finale” moment (winner announced)\n\n---\n\n## Father’s Day: food-led, plus last-minute walk-in angles\n\n![Father's Day Meal](/images/blog/fathers-day.png)\n\nFather’s Day is often decided late. People do not want a complicated plan. They want a place that makes it easy to do the right thing.\n\nYour job is to say, clearly: **Bring Dad. We’ll make it feel special.**\n\n### The three Father’s Day audiences to design for\n\n1. **Bookers**: organised, want reassurance and value\n2. **Last-minute planners**: need an easy win\n3. **Walk-ins**: want a warm welcome and a fast yes\n\nBuild an offer that speaks to all three.\n\n### Food-led activation ideas that feel special but stay simple\n\n### Idea 1: The “Dad’s Favourite” board\n\nOne hero dish, built for easy execution.\n\n* steak and chips\n* pie and pint\n* burger and pint\n* roast upgrade board\n* breakfast for Dad (brunch-led pubs)\n\n**Thought starter**\nName it. Put it on a table tent. Make it feel like a limited edition.\n\n#### Idea 2: The “Dad’s Table” sharer\n\nDesigned for groups and upsell, with minimal kitchen complexity.\n\n* mixed grill style board\n* wing and ribs platter\n* Sunday sharer roast board\n* “pick three sides” approach\n\n**Add-on**\nA simple dessert special that photographs well.\n\n#### Idea 3: The “Bring Dad a pint” ritual\n\nA ritual is memorable. Rituals become traditions.\n\nExamples:\n\n* “First pint is for Dad”: family members bring it to the table at the same time\n* A small “Dad’s toast” moment (short, not cringe)\n* A printed “Dad jokes” card on the table\n\n#### Idea 4: The “Dad and me” bundle\n\nThis works brilliantly for families.\n\n* adult main + kids meal + shared dessert\n* a low and no drink option for drivers\n* a “kids create a card” corner (paper, pens, two minutes)\n\nKeep it warm, not messy.\n\n### Last-minute walk-in angles that actually work\n\n### Make a walk-in plan, then advertise it\n\nWalk-ins happen when people believe they will not be turned away.\n\nDo this:\n\n* Allocate a few tables for walk-ins at specific times\n* Put a simple message on the door and socials: “Walk-ins welcome today”\n* Give the bar team a one-line script: “We can fit you in, shall I grab you a table?”\n\n### Speed up the kitchen without shrinking the experience\n\n* A reduced “Father’s Day highlights” menu for peak hours\n* Pre-prepped sharers\n* One hero dessert rather than five options\n\n### Give walk-ins a reward for showing up\n\nNot a discount. A feel-good extra:\n\n* a complimentary mini dessert for Dad\n* a coffee upgrade\n* a free soft drink for kids\n* a small prize draw entry\n\n---\n\n## The Cider Weekender: a mini-festival concept with huge energy\n\n![Cider Weekender Flight](/images/blog/cider-weekender.png)\n\nA “Cider Weekender” is powerful because it feels like a ticketed experience, but it is delivered with pub simplicity. It is made of rituals, not logistics.\n\n### The core concept\n\nA two-day celebration built around:\n\n* discovery\n* tasting\n* voting\n* light entertainment\n\n### Five ways to run it, from simplest to biggest\n\n### Version 1: The “Try 3” flight\n\nThe easiest starting point.\n\n* Choose three ciders that show range (style, sweetness, flavour)\n* Serve as a paddle or trio\n* Add a simple tasting card (dry, medium, fruity)\n\n**Thought starter**\nLet guests name their favourite and display a running tally on a chalkboard.\n\n### Version 2: The “Passport and prize” weekender\n\nCreate a small stamp card.\n\n* 1 stamp: cider serve\n* 1 stamp: food pairing\n* 1 stamp: bring a friend\n\nComplete it for:\n\n* a branded glass (if available)\n* a free upgrade next visit\n* a prize draw entry\n\n### Version 3: The “Pairing menu” approach\n\nCider is brilliant with food.\n\nPairing ideas:\n\n* spicy wings with crisp cider\n* pork, apple, and crackling bites\n* ploughman’s boards\n* loaded fries with tangy serves\n* cheese boards with drier styles\n\nMake it simple: 3 pairings, clearly named.\n\n### Version 4: The “Meet the maker” without the pressure\n\nYou do not need a full talk. You need presence.\n\n* a 20-minute informal chat\n* a “questions on a card” bowl\n* a photo with the products and a story board\n\n### Version 5: The “Mini-festival schedule”\n\nIf you want it to feel bigger:\n\n* Friday: opening night, first vote\n* Saturday: tasting peak, live music\n* Sunday: family-friendly afternoon, winner announced\n\n### Make it inclusive and modern\n\nSummer drinking is changing. You can lead it.\n\n* include at least one low or no option\n* highlight lighter ABV choices\n* promote water, and make it visible\n\n### The theatre that makes it shareable\n\n* an “orchard bar” corner (just a table dressed nicely)\n* bunting and a simple sign\n* a photo frame moment: “Cider weekend crew”\n* a “flavour map” on the wall where guests place stickers\n\n---\n\n## Wimbledon and Royal Ascot: premium but easy, dress-up optional\n\nThese moments are gold because they already carry status. You do not need to manufacture meaning. You just need to translate it into pub comfort.\n\nThe theme is: **a touch of occasion**.\n\n### Wimbledon: ideas that feel stylish without feeling fussy\n\n### Build a “Centre Court” afternoon\n\nEven if you are not showing every match, you can create the vibe:\n\n* bright serves\n* light bites\n* an afternoon treat menu\n\n**Food thought starters**\n\n* strawberries and cream inspired dessert\n* “picnic boards” with mini sandwiches, crisps, fruit\n* light sharers for grazing between sets\n\n**Drink thought starters**\n\n* spritz-style serves\n* a refreshing long drink highlight\n* a simple “match point” hero cocktail\n* low and no “court cooler”\n\n### Create rituals guests can join instantly\n\n* “Predict the set”: guests tick a card, win spot prizes\n* “Serve and volley challenge”: a quick table game\n* “Best Wimbledon outfit, optional”: keep it playful, never exclusionary\n\n### Turn it into a social occasion\n\nNot everyone cares about the sport. They care about the afternoon.\n\nRun:\n\n* “Wimbledon brunch into tennis”\n* “Afternoon tea, then the big match”\n* “Post-work Wimbledon hour”\n\n### Royal Ascot: premium energy, easy execution\n\nRoyal Ascot works because it gives people permission to dress up, or at least dress brighter. Your job is to say: **Join us your way.**\n\n### The premium-but-easy approach\n\n* one headline serve that feels glamorous\n* an elevated snack menu\n* a small prize for “best effort” style\n\n**Food thought starters**\n\n* cheese and charcuterie boards\n* mini dessert trio\n* posh crisps and nuts selection\n* “race day sharers”\n\n**Drink thought starters**\n\n* summer cup style jugs\n* spritz menu\n* a “house celebratory serve” with sparkling options\n* alcohol-free sparkle for designated drivers\n\n### Keep dress-up genuinely optional\n\nMake the tone welcoming:\n\n* “Hats welcome, not required”\n* “Dress up if you fancy it”\n* “Come as you are, leave feeling a bit brighter”\n\n### Make it interactive without making it awkward\n\nSkip anything that feels like gambling. Keep it playful.\n\n* “Pick the winner” sweepstake for prizes like bar snacks or soft drinks\n* “Style awards”: best hat, best tie, brightest colour\n* “Photo finish” photo corner with a simple backdrop\n\n---\n\n## Wine brochure moments: tasting nights pubs can run without specialists\n\n![Wine Tasting](/images/blog/wine-tasting.png)\n\nA wine tasting night does not need expertise. It needs clarity, warmth, and structure.\n\nYour audience is not wine obsessives. It is guests who want to learn a little and enjoy a social evening.\n\n### The easiest wine tasting format: “6 wines, 3 minutes each”\n\nThis is simple, fast, and fun.\n\n* 6 wines\n* a tasting card with 4 descriptors per wine\n* a “favourite of the night” vote\n* small food bites to anchor the experience\n\n**Tasting card prompts**\n\n* crisp or rounded\n* light or rich\n* fruity or dry\n* your rating out of 5\n\n### Wine night formats that work brilliantly in pubs\n\n### Format 1: “Around the world”\n\nSix wines, six places.\nDecorate tables with tiny flags and one sentence per wine.\n\n### Format 2: “Grape versus grape”\n\nTwo whites, two reds, one wildcard, one crowd-pleaser.\nGuests vote for the winning grape.\n\n### Format 3: “Light to rich”\n\nA simple journey that teaches people without lecturing.\n\n### Format 4: “Wine and cheese, simplified”\n\nThree wines, three cheeses, no complicated rules.\nUse plain language: “this one is creamy, try it with the richer wine”.\n\n### Format 5: “Blind tasting, no pressure”\n\nGuests guess red or white, light or rich.\nMake the prizes funny, not intimidating.\n\n### Format 6: “Speed tasting social”\n\nPerfect for small pubs or weeknights.\n\n* small pours\n* guests move tables\n* a bell every five minutes\n  It becomes a social mixer with wine as the reason to show up.\n\n### How to run it without specialists\n\n* Pre-brief the team with a one-page cheat sheet\n* Use simple descriptors, not technical notes\n* Keep the pace friendly\n* Always offer water and a food anchor\n* Make the goal enjoyment, not education\n\n### The upsell that feels natural\n\nAt the end:\n\n* “Winner wine by the glass all weekend”\n* “Take the night home”: bottle offer for tables\n* a simple pairing board as the “next step”\n\n---\n\n## Bonus: turn “national drink days” into micro-moments without overwhelm\n\nThere are lots of “days”. You do not need to chase them all. The trick is to use them as a reason to refresh your message.\n\n### The hero serve strategy\n\nPick a small set of hero serves for summer, then rotate the spotlight.\nFor example:\n\n* one spritz-style serve\n* one tropical serve\n* one crisp long drink\n* one no and low hero\n\nThen, when a themed day appears on the calendar, you simply point the spotlight at the relevant hero serve rather than inventing something new.\n\n### Micro-moment ideas that take 10 minutes to set up\n\n* “Hero serve happy hour” (short window, big clarity)\n* “Garnish upgrade” day (simple theatre)\n* “Two-serve showdown” vote\n* “Try it in a jug” group serve push\n* “Food pairing prompt” on the bar\n\nThe goal is to stay fresh without creating chaos.\n\n---\n\n## Make your activations feel bigger with tiny marketing moves\n\nIdeas are only half the job. The other half is making sure people actually notice.\n\n### The three places your message must show up\n\n1. **At the door**: what is happening today?\n2. **At the bar**: what should I order?\n3. **On the table**: what can we add?\n\nIf your headline lives in all three places, you will sell more with less effort.\n\n### Staff scripts: the simplest high-impact tool\n\nGive the team one friendly line per activation.\n\nExamples:\n\n* “It’s our Cider Weekender, fancy a quick flight to try a few?”\n* “We’ve got a Father’s Day board today, perfect for the table.”\n* “It’s Wimbledon afternoon here, we’re doing picnic sharers and spritzes.”\n* “Wine tasting night next week, want me to pop you the details?”\n\nScripts beat posters because they create a personal invitation.\n\n### Make it photographic\n\nIf you want social sharing, you need one or two “camera moments”.\n\n* the hero drink\n* the sharer board\n* the stamp card\n* the photo corner\n\nKeep it consistent. Repetition builds recognition.\n\n### Create a simple rhythm\n\nA rhythm becomes a habit.\n\nExamples:\n\n* Friday: “Sundown Sessions”\n* Saturday: “Big Weekend”\n* Sunday: “Sharers and Sips”\n* One weeknight: “Taste and Try” (cider or wine)\n\nYou are not just filling days. You are creating reasons to return.\n\n---\n\n## A big list of thought starters you can mix and match\n\nUse these like building blocks. Pick three and you have a campaign.\n\n### Naming ideas\n\nA name turns a good idea into a remembered idea.\n\n* “The Summer Social”\n* “Garden Hours”\n* “The Weekender”\n* “Sips and Sharers”\n* “The Sunday Club”\n* “Dress-up Optional”\n* “Taste Trail”\n* “The Local’s Favourite”\n* “Sunshine Sessions”\n* “The After-Work Escape”\n\n### Low-lift interactive ideas\n\n* vote boards\n* stamp cards\n* “favourite of the night”\n* spot prizes\n* playlist requests\n* table challenges\n* “bring a friend” reward\n\n### Premium cues without premium cost\n\n* nicer glassware\n* consistent garnishes\n* a small menu insert\n* table cards\n* a “limited edition” headline\n* a bit of music and lighting intention\n\n### Food-led anchors that sell well in summer\n\n* sharer boards\n* picnic-style platters\n* flatbreads and easy bakes\n* small plates designed for grazing\n* a signature summer dessert\n* a one-dish special done brilliantly\n\n### Inclusive options that broaden your audience\n\n* alcohol-free hero serve that looks as good as the alcoholic version\n* lighter and spritz-style serves\n* family-friendly time windows\n* clear “walk-ins welcome” messaging\n\n---\n\n## Your next step: choose your summer story\n\nIf you only do one thing after reading this, do this:\n\nPick three moments you want to own between May and August, and give each one:\n\n* a simple promise\n* a hero serve\n* a food anchor\n* one ritual guests can join instantly\n\nThen repeat.\n\nSummer success is rarely about one huge weekend. It is about being the place that always has something going on, in a way that feels easy, inviting, and just a little bit special.\n\nIf you want, tell me what kind of pub you are (food-led, wet-led, village local, town centre, garden size, screen set-up) and I will turn this into a tailored May to August calendar with ready-to-run themes, poster headlines, and staff one-liners.\n",
      "summary": "No description available",
      "date_published": "2026-01-28T00:00:00.000Z",
      "date_modified": "2026-01-28T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": ["summer", "campaigns", "events", "marketing"],
      "image": "https://www.orangejelly.co.uk/images/blog/summer-moments-simple-campaigns.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/instagram-marketing-for-pubs",
      "url": "https://www.orangejelly.co.uk/licensees-guide/instagram-marketing-for-pubs",
      "title": "Instagram Marketing for Pubs: Turn Food Photos Into Foot Traffic",
      "content_html": "\n# Instagram Marketing for Pubs: Turn Food Photos Into Foot Traffic\n\nInstagram is not just about pretty photos. It is about showing the experience and making it easy for people to choose you. The winning formula is consistent visuals, clear offers, and a simple booking path.\n\n## Step 1: Set a visual standard\n\nUse natural light, clean backgrounds, and consistent framing. A simple phone setup is enough if it is consistent.\n\n## Step 2: Build three content pillars\n\n- **Food and drink**: your strongest sellers.\n- **People and atmosphere**: the room and the crowd.\n- **Events and offers**: the reason to visit.\n\nRotate these each week.\n\n## Step 3: Post with a clear CTA\n\nEvery post should answer: what should the viewer do next?\n\nExamples:\n- \"Book for Thursday now.\"\n- \"Walk-ins welcome after 7.\"\n- \"DM to reserve a table.\"\n\n## Step 4: Use stories for urgency\n\nStories are perfect for availability updates, behind-the-scenes clips, and quick reminders. Use them daily during event weeks.\n\n## Step 5: Engage locally\n\nComment on local posts, tag partners, and use local hashtags. Instagram rewards local relevance.\n\n## Common mistakes\n\n- Posting without a clear offer.\n- Using dark or blurry photos.\n- Ignoring comments and DMs.\n\n## Quick checklist\n\n- Three content pillars planned.\n- Weekly posting rhythm set.\n- CTA added to every post.\n- Stories used for urgency.\n\n## Mini FAQ\n\n**Do I need a professional camera?**\nNo. A phone and consistent light are enough.\n\n**How often should I post?**\nThree to four posts a week plus stories during event weeks.\n",
      "summary": "Transform your pub's Instagram from amateur snapshots to a customer magnet. Learn photography tricks, hashtag strategies, and content ideas that fill",
      "date_published": "2025-12-26T00:00:00.000Z",
      "date_modified": "2025-05-05T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": [
        "pub Instagram ideas",
        "Instagram for pubs",
        "social media marketing",
        "pub photography",
        "Instagram marketing"
      ],
      "image": "https://www.orangejelly.co.uk/images/blog/instagram-marketing-for-pubs.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/how-to-run-successful-pub-events",
      "url": "https://www.orangejelly.co.uk/licensees-guide/how-to-run-successful-pub-events",
      "title": "How to Run Successful Pub Events: A Complete Guide to Profitable Functions",
      "content_html": "\n# How to Run Successful Pub Events: A Complete Guide to Profitable Functions\n\nEvents work when they are treated like a product, not a one-off idea. The formula is simple: clear concept, tight pricing, focused promotion, and a smooth run sheet.\n\n## Step 1: Choose the right concept\n\nPick one event that fits your audience and your team. The best events are repeatable and easy to explain.\n\nExamples: quiz night, tasting board, live music, or a local partner takeover.\n\n## Step 2: Build the pricing model\n\nUse a fixed price or deposit to secure attendance. Add one upsell to protect margin.\n\n## Step 3: Promote early and consistently\n\nStart promotion three to four weeks ahead. Use the same message and booking link across all channels.\n\n## Step 4: Run the night with a script\n\nA simple run sheet keeps the event smooth. Include:\n- Welcome moment.\n- Key announcements.\n- Upsell cues.\n- Final call to book the next event.\n\n## Step 5: Follow up within 48 hours\n\nSend a thank you message and invite guests to the next event. This is where repeat bookings come from.\n\n## Common mistakes\n\n- Leaving booking open-ended.\n- Promoting once and stopping.\n- Overcomplicating the event format.\n\n## Quick checklist\n\n- Concept chosen and priced.\n- Booking link live.\n- Run sheet printed.\n- Follow-up message scheduled.\n\n## Mini FAQ\n\n**Do I need a big budget to run events?**\nNo. Small, repeatable events often outperform expensive one-offs.\n\n**How often should I run events?**\nConsistency matters more than volume. One strong event per week can be enough.\n",
      "summary": "Transform your quiet nights into packed events. From planning to promotion, learn the proven formula for running profitable pub events that create loyal",
      "date_published": "2025-12-19T00:00:00.000Z",
      "date_modified": "2025-06-02T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": [
        "pub events",
        "event planning",
        "pub entertainment",
        "event ideas",
        "customer engagement"
      ],
      "image": "https://www.orangejelly.co.uk/images/blog/how-to-run-successful-pub-events.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/food-allergies-gdpr-compliance",
      "url": "https://www.orangejelly.co.uk/licensees-guide/food-allergies-gdpr-compliance",
      "title": "Food Allergies and GDPR: The Compliance Nightmares That Could Close You Down",
      "content_html": "\n# Food Allergies and GDPR: The Compliance Nightmares That Could Close You Down\n\nCompliance is not exciting, but it is non-negotiable. Allergen mistakes and data breaches can shut a pub down. The good news is that simple systems prevent most problems.\n\nThis guide is practical, not legal advice. Always check the latest guidance and regulations.\n\n## Part 1: Allergen safety system\n\n**1) Build the master matrix**\nCreate a spreadsheet with every menu item and the 14 allergens. Update it whenever recipes change. Print and keep a copy in the kitchen and at the bar.\n\n**2) Maintain an ingredient file**\nKeep supplier spec sheets and product labels in one folder. Date each update.\n\n**3) Create a clear service protocol**\nTrain staff to say: \"Let me check.\" No guessing. Use a simple flow: order, check matrix, confirm with the kitchen, then confirm with the guest.\n\n**4) Control cross-contamination**\nUse separate boards and clear labeling for allergen-free prep. This is basic but vital.\n\n## Part 2: GDPR basics for pubs\n\n**1) Collect consent properly**\nIf you collect emails or phone numbers, you need clear opt-in. Avoid pre-ticked boxes.\n\n**2) Store data securely**\nUse password-protected systems. Limit who can access the list.\n\n**3) Respond quickly to requests**\nIf someone asks for their data or wants to be removed, respond within 30 days.\n\n**4) Keep data only as long as needed**\nRegularly delete old, inactive records.\n\n## Common mistakes\n\n- Outdated allergen lists.\n- Staff guessing answers.\n- Collecting emails without consent.\n- Sharing lists between personal devices.\n\n## Quick checklist\n\n- Allergen matrix updated and printed.\n- Staff trained on the \"let me check\" rule.\n- Consent form in place for emails.\n- Data stored securely and reviewed quarterly.\n\n## Mini FAQ\n\n**Do I need a lawyer?**\nNot always, but professional advice can help if you are unsure about your responsibilities.\n\n**How often should I update allergen info?**\nEvery time a recipe changes and at least quarterly.\n",
      "summary": "Navigate the compliance minefield without hiring expensive consultants. Simple systems that keep you legal and let you focus on running your pub.",
      "date_published": "2025-12-12T00:00:00.000Z",
      "date_modified": "2025-12-12T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": [
        "allergen management",
        "GDPR compliance",
        "food safety",
        "pub regulations",
        "compliance systems"
      ],
      "image": "https://www.orangejelly.co.uk/images/blog/food-allergies-gdpr-compliance.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/fill-empty-seats-midweek-offers",
      "url": "https://www.orangejelly.co.uk/licensees-guide/fill-empty-seats-midweek-offers",
      "title": "Fill Empty Seats: Proven Midweek Offers That Actually Convert",
      "content_html": "\n# Fill Empty Seats: Proven Midweek Offers That Actually Convert\n\nQuiet nights are rarely a mystery. The offer is usually invisible, too vague, or too discount heavy. The fix is a clear promise, limited capacity, and a reason to book now rather than later.\n\nThis is the framework we use to turn slow midweek nights into planned visits.\n\n## Step 1: Start with data, not guesses\n\nIdentify your two quietest sessions and the average spend per head. You need to know what you are trying to lift.\n\nIf Tuesday lunch is your weakest, design an offer for Tuesday lunch. Do not build a generic offer and hope it lands.\n\n## Step 2: Pick one promise per night\n\nEach night should have a single reason to visit.\n\nExamples:\n- \"Steak and red wine set menu.\"\n- \"Local supplier night with a tasting board.\"\n- \"Midweek club with a fixed price bundle.\"\n\nOne promise is easier to sell and easier to deliver.\n\n## Step 3: Pre-book and pre-pay\n\nEven a small deposit increases commitment. Use a simple booking form and cap the number of covers. Scarcity makes it feel intentional.\n\n## Step 4: Stack upsells that protect margin\n\nThe offer gets them in the door. The upsell protects the profit.\n\n- Add a premium side option.\n- Offer a set drink pairing.\n- Create a dessert or coffee add-on.\n\n## Step 5: Promote in tight bursts\n\nRun a three-day promo burst each week. Same message, same CTA, repeated across channels.\n\nExample rhythm:\n- Monday: announce the offer.\n- Tuesday: post proof and availability.\n- Wednesday: final call.\n\n## Step 6: Measure ruthlessly\n\nTrack covers, spend per head, and margin for that night only. If it does not move the needle after four weeks, change the promise.\n\n## Common mistakes\n\n- Discounting without an upsell plan.\n- Changing the offer every week.\n- Leaving booking open-ended.\n- Promoting once and stopping.\n\n## Quick checklist\n\n- One quiet session selected.\n- One clear promise written.\n- Booking cap set with a deposit.\n- Upsells attached.\n- Weekly results tracked.\n\n## Mini FAQ\n\n**Should I run different offers every week?**\nNo. Repetition builds habit. Change after four to six weeks if it is not working.\n\n**What if people only come for the deal?**\nThat is the point. Once they are in, you sell the experience and the add-ons.\n",
      "summary": "Design midweek offers that protect gross profit, excite locals, and keep the brigade busy instead of staring at empty tables.",
      "date_published": "2025-12-05T00:00:00.000Z",
      "date_modified": "2025-12-01T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": ["midweek offers", "pub marketing", "bundles", "footfall", "promotions"],
      "image": "https://www.orangejelly.co.uk/images/blog/fill-empty-seats-midweek-offers.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/fill-empty-pub-tables",
      "url": "https://www.orangejelly.co.uk/licensees-guide/fill-empty-pub-tables",
      "title": "How to Fill Empty Pub Tables: 15 Strategies That Actually Work",
      "content_html": "\n# How to Fill Empty Pub Tables: 15 Strategies That Actually Work\n\nEmpty tables are more than lost revenue – they're missed connections, silent atmosphere killers, and visible signs that something's not quite right. After turning around The Anchor from quiet nights to consistently full tables, I've learned what actually fills those profit-draining voids.\n\n## Understanding the Empty Table Problem\n\n### What Empty Tables Really Cost You\n\nLet's do the maths that keeps landlords awake at night:\n\n- **Average spend per table**: £45 (2.3 people × £19.50 average spend)\n\n- **Tables empty per service**: 8\n\n- **Services per week**: 14\n\n- **Weekly lost revenue**: £5,040\n\n- **Annual impact**: £262,080\n\nThat's a quarter of a million pounds sitting in empty chairs. But the real cost goes deeper:\n\n- **Atmosphere dies**: Empty tables create empty atmosphere\n\n- **Staff efficiency drops**: Underworked staff lose their edge\n\n- **Reputation suffers**: \"It's always empty\" becomes your brand\n\n- **Spiral effect**: Empty attracts empty\n\n## The Psychology of Table Choice\n\nBefore diving into solutions, understand why customers choose tables:\n\n1. **Social proof**: People want to sit where others are sitting\n\n1. **Comfort zones**: Not too close to loos, kitchen, or door\n\n1. **Purpose matching**: Romantic couples want different tables than work meetings\n\n1. **Territory marking**: Regulars have \"their\" spots\n\n## 15 Proven Strategies to Fill Your Empty Tables\n\n### 1. Strategic Table Management\n\n**The Problem**: All tables treated equally, filled randomly.\n\n**The Solution**:\n\n- Fill tables strategically to create buzz zones\n\n- Start filling from the middle outward\n\n- Keep window tables full during peak visibility hours\n\n- Close sections during quiet periods to concentrate atmosphere\n\n**Our Result**: The same number of customers felt noticeably more by strategic placement.\n\n### 2. The \"Golden Hours\" Pricing Strategy\n\n**The Concept**: Dynamic pricing based on demand.\n\n**Implementation**:\n\n- 25% off tables booked for 5-6:30pm\n\n- \"Sunset Special\" menu for early diners\n\n- Late night table deals after 9pm\n\n- Midweek table packages\n\n**Key Success**: Noticeable lift in Tuesday-Thursday 5pm bookings.\n\n### 3. Create Instagram-Worthy Table Settings\n\n**Why It Works**: Every filled table becomes marketing.\n\n**What We Did**:\n\n- Seasonal table decorations (£20/month budget)\n\n- Signature table settings for special occasions\n\n- \"Chef's Table\" with unique presentation\n\n- Photo-friendly corner with perfect lighting\n\n**Impact**: A steady stream of daily social posts featuring our tables.\n\n### 4. The \"Community Table\" Concept\n\n**The Innovation**: One large communal table for singles/small groups.\n\n**Benefits**:\n\n- Fills faster than individual tables\n\n- Creates natural conversation\n\n- Builds regular community\n\n- Efficient use of space\n\n**Surprising Result**: Our community table stays consistently busy.\n\n### 5. Implement Smart Booking Systems\n\n**The Tech Solution**:\n\n- Online booking showing real-time availability\n\n- Automated confirmation texts\n\n- Waitlist management for walk-ins\n\n- Data tracking for pattern analysis\n\n**Game Changer**: Noticeable lift at The Anchor in advance bookings inside 30 days.\n\n### 6. Partner With Local Businesses\n\n**Strategic Partnerships**:\n\n- \"Working lunch\" deals with nearby offices\n\n- Post-gym meals with fitness centres\n\n- Pre-theatre menus with local venues\n\n- Team meeting packages\n\n**Our Win**: A reliable midweek block booking from one office.\n\n### 7. The \"Table Time Limit\" Psychology\n\n**The Approach**: Subtle time management without being pushy.\n\n**Tactics**:\n\n- 2-hour slots for peak times (clearly communicated)\n\n- Express lunch menu with time guarantee\n\n- Gentle booking reminders\n\n- Efficient, attentive service\n\n**Result**: Noticeable lift at The Anchor in table turns during peak hours.\n\n### 8. Weather-Responsive Promotions\n\n**The Reality**: British weather impacts footfall dramatically.\n\n**Rainy Day Strategies**:\n\n- \"Singing in the Rain\" cocktail specials\n\n- Comfort food push notifications\n\n- Umbrella storage service\n\n- Cosy corner highlighting\n\n**Sunny Day Tactics**:\n\n- Extended outdoor seating\n\n- \"Sunshine Menu\" launches\n\n- Ice cream cocktail features\n\n- Garden party atmosphere\n\n**Smart Move**: Weather-triggered social media posts drove a noticeable lift in rainy day bookings.\n\n### 9. Create Themed Table Experiences\n\n**Beyond Basic Dining**:\n\n- Murder mystery table packages\n\n- Wine tasting table setups\n\n- Cheese and craft beer pairings\n\n- Sunday roast \"family tables\"\n\n**Investment**: Modest setup cost\n\n**Return**: Noticeable lift in first-month revenue\n\n### 10. The \"Local Hero\" Table Programme\n\n**Community Connection**:\n\n- Free table for local charity meetings\n\n- Community group priority booking\n\n- Local sports team celebration space\n\n- School fundraiser headquarters\n\n**Indirect Benefit**: Each group brings 8-12 paying supporters.\n\n### 11. Leverage FOMO Marketing\n\n**Creating Urgency**:\n\n- \"Only 3 tables left tonight\" posts\n\n- Limited-time table offers\n\n- Exclusive table-only menu items\n\n- VIP table membership scheme\n\n**Psychology Works**: Noticeable lift at The Anchor in same-day bookings.\n\n### 12. Staff Training for Table Filling\n\n**The Human Element**:\n\n- Teach strategic seating\n\n- Upselling table packages\n\n- Creating atmosphere in quiet areas\n\n- Turning enquiries into bookings\n\n**Key Metric**: Trained staff convert more enquiries to bookings.\n\n### 13. The \"Doggy Dining\" Revolution\n\n**Tapping New Markets**:\n\n- Dedicated dog-friendly tables\n\n- Doggy menu and water bowls\n\n- Monthly \"Yappy Hour\"\n\n- Social media feature: \"Pup of the Week\"\n\n**Unexpected Win**: Dog owners are incredibly loyal, visiting more frequently.\n\n### 14. Data-Driven Table Management\n\n**Track Everything**:\n\n- Peak occupancy times\n\n- Average dwell time per table type\n\n- Booking no-show rates\n\n- Table preference patterns\n\n**Use Data To**:\n\n- Adjust staffing levels\n\n- Plan promotional timing\n\n- Redesign table layout\n\n- Predict busy periods\n\n**Example**: Data showed corner tables were less popular - we added better lighting and they're now premium spots.\n\n### 15. The \"Experience Economy\" Approach\n\n**Beyond Food and Drink**:\n\n- Quiz tables with dedicated quizmaster\n\n- Board game library for each table\n\n- Phone charging stations\n\n- Blankets for garden tables\n\n**Investment Thinking**: People pay for experiences, not just products.\n\n## Implementation Timeline\n\n### Week 1: Assessment and Quick Wins\n\n- Audit current table usage patterns\n\n- Implement strategic filling\n\n- Update Google listing with table booking\n\n- Train staff on new approach\n\n### Week 2-4: Systems and Partnerships\n\n- Launch online booking\n\n- Contact local businesses\n\n- Create first themed night\n\n- Start social media strategy\n\n### Month 2-3: Build and Refine\n\n- Analyse data and adjust\n\n- Expand successful initiatives\n\n- Add technology solutions\n\n- Create regular events calendar\n\n### Month 4-6: Scale and Optimise\n\n- Fine-tune all systems\n\n- Expand partnership network\n\n- Build customer database\n\n- Plan seasonal campaigns\n\n## Measuring Success\n\n### Key Metrics to Track:\n\n- **Occupancy rate** by day/time\n\n- **Average spend** per table\n\n- **Booking conversion** rate\n\n- **Table turn** frequency\n\n- **Customer return** rate\n\n### Our 6-Month Results:\n\n- **Table occupancy**: From quiet to consistently full\n\n- **Average spend**: Noticeable lift per table\n\n- **Advance bookings**: Noticeable lift\n\n- **No-show rate**: Noticeably reduced\n\n- **Weekly revenue**: Noticeable lift\n\n## Common Mistakes to Avoid\n\n1. **Desperate discounting**: Cheap doesn't fill tables sustainably\n\n1. **Ignoring atmosphere**: Full but miserable isn't success\n\n1. **Overcomplicating**: Simple, well-executed beats complex\n\n1. **Inconsistency**: Regular reliable offerings build habits\n\n1. **Not tracking results**: You can't improve what you don't measure\n\n## Frequently Asked Questions\n\n### How quickly can I expect to see results?\n\nMeaningful, bankable progress inside 30 days. Week 1 brings more website traffic and phone calls, week 2 builds momentum and tuning, week 4 delivers noticeably fuller evenings and consistent enquiries. Full transformation typically takes six months of consistent implementation.\n\n### What if I can't afford booking systems?\n\nStart with free tools: Google Forms, Facebook bookings, even a diary. Systems can come later.\n\n### Should I turn away walk-ins to keep tables for bookings?\n\nNo. Use intelligent table management. Keep 20-30% for walk-ins during peak times.\n\n### How do I handle regular customers who expect \"their\" table?\n\nCreate a VIP system that rewards loyalty while maintaining flexibility. Communication is key.\n\n### What's the single most effective strategy?\n\nStrategic table filling combined with social proof marketing. Make your pub look busier than it is.\n\n### How do I compete with chain restaurants?\n\nDon't. Offer what they can't: personality, flexibility, community connection, unique experiences.\n\n## Your Next Steps\n\n1. **Walk your floor**: Identify problem tables and dead zones\n\n1. **Pick three strategies**: Start with quick wins\n\n1. **Set measurable goals**: X% occupancy by Y date\n\n1. **Track religiously**: Data drives decisions\n\n1. **Iterate quickly**: Drop what doesn't work, double down on what does\n\n## The Challenge\n\nThis weekend, implement just ONE strategy from this guide. Measure the results. Build from there. Empty tables are just opportunities waiting to be filled.\n\n## Ready to Transform Your Table Occupancy?\n\nDownload our free \"Table Filling Toolkit\" including:\n\n- Booking conversion scripts\n\n- Social media templates\n\n- Partnership proposal letters\n\n- Tracking spreadsheets\n\n- Staff training guides\n\nRemember: Every bustling pub started with empty tables. The difference between struggle and success is taking action. Which strategy will you implement first?\n\nYour empty tables are waiting to become profit centres. Let's fill them.\n\n## Frequently Asked Questions\n\n### What is the main reason pubs are empty?\n\nThe primary cause is usually poor visibility and communication. Customers don't know what's happening at your pub. Secondary factors include atmosphere, value perception, and competition. Fixing visibility through social media and events typically lifts footfall.\n\n### Which day of the week is usually quietest?\n\nTuesday is typically the quietest day for most pubs, followed by Monday and Wednesday. Combat this with specific midweek offers, regular events like quiz nights, and targeted social media campaigns. The Anchor saw weekday revenue lift ~20% using these strategies.\n\n### How quickly will I see results?\n\nMost strategies show meaningful, bankable progress inside 30 days. Week 1 brings more website traffic and phone calls, week 2 builds momentum and tuning, week 4 delivers noticeably fuller evenings and consistent enquiries. Full transformation typically takes six months of consistent implementation.\n\n### How much will this cost to implement?\n\nImplementation costs vary by strategy. Many improvements like social media optimization and operational changes cost nothing beyond time. Events may require £50-200 initial investment. Professional support is available at £75 per hour plus VAT.\n\n### Can this work for my type of pub?\n\nYes, these strategies are proven across wet-led, food-led, and hybrid pubs. The key is adapting the approach to your specific circumstances, customer base, and local market. All strategies come from real-world success at The Anchor.\n",
      "summary": "Practical tactics to transform your empty tables into bustling profit centres. Tested at The Anchor.",
      "date_published": "2025-11-28T00:00:00.000Z",
      "date_modified": "2025-02-17T01:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": [
        "fill empty tables",
        "get more pub customers",
        "increase pub bookings",
        "pub marketing strategies"
      ],
      "image": "https://www.orangejelly.co.uk/images/blog/fill-empty-pub-tables.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/facebook-marketing-local-pubs",
      "url": "https://www.orangejelly.co.uk/licensees-guide/facebook-marketing-local-pubs",
      "title": "Facebook Marketing for Local Pubs: Your Community Connection Goldmine",
      "content_html": "\n# Facebook Marketing for Local Pubs: Your Community Connection Goldmine\n\nFacebook is still where local communities plan their week. Done properly, it can fill tables without expensive ads. The key is to treat it as a community channel, not just a noticeboard.\n\n## Step 1: Fix the basics on your page\n\n- Correct opening hours.\n- A clear booking link.\n- Current photos of food and the room.\n\nOutdated pages kill trust fast.\n\n## Step 2: Use events properly\n\nCreate Facebook events for quizzes, tastings, and live music. Invite regulars and ask staff to share. Events create reminders and reach beyond your followers.\n\n## Step 3: Be present in local groups\n\nLocal groups drive real footfall. Do not spam. Post useful updates and respond to comments. The goal is to be helpful, not salesy.\n\n## Step 4: Run small, targeted ads\n\nA small budget can go a long way when targeting a 5 to 10 mile radius. Promote one clear offer with a booking link.\n\n## Step 5: Use Messenger for bookings\n\nMake it easy for people to ask questions and book. Quick replies build trust and convert faster.\n\n## Weekly rhythm\n\n- Monday: what is on.\n- Wednesday: event reminder.\n- Friday: social proof or live update.\n\n## Common mistakes\n\n- Posting without a CTA.\n- Ignoring comments.\n- Using stock photos instead of real ones.\n\n## Quick checklist\n\n- Page updated.\n- Events created for key nights.\n- Group posts scheduled.\n- Messenger replies set up.\n\n## Mini FAQ\n\n**Is Facebook still worth it?**\nFor local pubs, yes. It often outperforms other platforms for bookings.\n\n**How often should I post?**\nTwo to three times a week is enough if it is consistent.\n",
      "summary": "Unlock Facebook's potential for your pub with proven strategies for events, community building, and local marketing. Turn your village Facebook group into",
      "date_published": "2025-11-21T00:00:00.000Z",
      "date_modified": "2025-04-28T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": [
        "pub Facebook marketing",
        "Facebook for pubs",
        "local pub marketing",
        "social media strategy",
        "community marketing"
      ],
      "image": "https://www.orangejelly.co.uk/images/blog/facebook-marketing-local-pubs.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/theme-hour-power-hour",
      "url": "https://www.orangejelly.co.uk/licensees-guide/theme-hour-power-hour",
      "title": "Theme Hour Saturdays: Power Hour & Spin-to-Win Toolkit",
      "content_html": "\n# Theme Hour Saturdays: Power Hour & Spin-to-Win Toolkit\n\nSaturday pre-peak (4–6pm) is prime for a punchy activation that fills the bar without cannibalising dining tables. Theme Hour keeps it tight: 60 minutes of nostalgia hits, predictable scripts, and repeatable prize mechanics.\n\n## Why Theme Hour Works\n- **Short and sharp:** Guests commit to one hour, then stay for dinner or rebook for next week.\n- **Low lift:** Reuse existing playlists, handheld mics, and prize stock.\n- **Margin friendly:** £12–£14 Power-Hour Spritz bundle delivers healthy GP and anchors the promo.\n- **Content factory:** Every spin, winner, and crowd sing-along becomes a reel for the following week.\n\n## Choose Your Theme\n\n| Theme | Structure | Staff Needed | Prize Ideas |\n| --- | --- | --- | --- |\n| **80s/90s Power Hour** | 6× ten-minute mini sets (sing-alongs, trivia shout-outs, air-guitar comp) | MC + floor runner + DJ/tablet operator | Retro merch, dinner vouchers, branded tapes |\n| **Spin-to-Win Wheel** | Wheel with 8 wedges (spritz upgrade, merch, surprise task) triggered every 10 mins | MC + host to verify spins | Sponsor tabs, dessert shots, queue skips |\n| **Playlist Battle** | Two playlists compete; crowd applause meter decides the winner | MC + volunteer counters | Round of drinks for the team on stage |\n| **Flash Challenge Hour** | Dance-off, lyric-finish, “guess the riff” back-to-back | MC only if using autop-run cues | Gift cards, dessert tokens, VIP booth |\n\nPick one theme per month to build muscle memory for staff and regulars.\n\n## Run-of-Show (Example for Power Hour)\n| Time | Beat | Notes |\n| --- | --- | --- |\n| T-30 | Staff brief, test mic + speaker, pre-batch spritz pitchers | Scripted cards printed |\n| 00:00 | MC welcome, plug bundle + dinner bookings | Spotlight next Theme Hour date |\n| 00:05 | Mini challenge #1 (finish the lyric) | Winner gets spritz upgrade |\n| 00:15 | Competition #2 (dance cam) | Capture video for socials |\n| 00:25 | Spin-the-wheel break | Offer private booth upsell |\n| 00:35 | Flash trivia blitz (5 questions) | Use QR to capture emails |\n| 00:45 | Final showdown (choir sing-off) | Promote after-party playlist |\n| 00:55 | Winners parade + next-week teaser | Push booking QR again |\n\nKeep the MC script in 5-minute increments so covering staff can run it if the lead calls in sick.\n\n## Prize & Bundle Mechanics\n- **Power-Hour Spritz:** £12 per serve (Prosecco/AF option, garnish skewer, branded stirrer). Offer buy-3-get-4th for tables.\n- **Wheel wedges:** 2× “Spritz on us,” 2× “Spin again,” 1× “Merch drop,” 1× “Pick the next song,” 1× “Chef’s snack,” 1× “Neighbour shout-out.”\n- **Stamps:** Attend four Theme Hours, unlock a “booth takeover” for the group.\n- **Local collabs:** Print instant photo souvenirs (£1 cost, £5 upsell) with sponsor logo.\n\n## Promotion Timetable\n- **Monday:** Drop teaser reel with last week’s winners + CTA.\n- **Wednesday:** Send SMS/WhatsApp reminder to booking list (“Spin-to-Win seats released for Saturday 4pm”).\n- **Friday:** Print table toppers for lunch service pushing the hour.\n- **Saturday morning:** Post schedule graphic + prize highlight. Encourage DMs for booth reservations.\n\n## Ops & Safeguarding\n- Keep walkway clear around the wheel or dance floor; mark out zones with tape.\n- Sound limiter in place if you’re in residential zones; have a “crowd cheer” meter that works at low volume.\n- Pre-assign a staff member to capture consent for photos (wristbands for opt-outs).\n- If drinks promos are in effect, stick to “bundled value” (spritz + snack) rather than straight discounts to stay within licensing guidance.\n- Debrief at 6pm sharp before dinner shift: what hit, what to tweak, prize stock left.\n\n## Measuring Success\n| KPI | Goal | How |\n| --- | --- | --- |\n| Bar revenue 4–6pm | Lift vs baseline | Compare POS by week |\n| Bundle attachment | Strong | Dedicated PLU |\n| Dinner rollover bookings | Steady per hour | QR/res list |\n| Content captured | A handful per event | Shot list tracking |\n\n## Copy Snippets\n- **Caption:** “Theme Hour • Saturdays 4–5pm • 80s vs 90s + spin wheel prizes + Power-Hour Spritz. Limited booths — DM to grab yours.”\n- **MC line:** “Spin wins only land if you’re holding a spritz — grab one at the bar before the next cue.”\n- **Staff script:** “We wrap at 5 so you can slide into dinner — want me to check the bookings list for you now?”\n\n## FAQs\n**Do I need extra security?** Not usually, but brief your SIA team (if you have one) on the schedule so they’re ready for sing-along surges or prize excitement.\n\n**How loud should it be?** Keep below conversation-crushing levels. Theme Hour is about energy, not raves. Use wireless mics with compressors to avoid peaks.\n\n**What if guests arrive late?** Run a “wildcard pass” at the halfway mark so newcomers can jump straight into a challenge without knowing earlier rules.\n\n**Can I run it outdoors?** Yes, but use battery-powered speakers, waterproof wheel coverings, and always have a rain move-in plan (folding tables, canopy, towels).\n\nMake Theme Hour the Saturday ritual that ushers day-drinkers into dinner spend and gives staff something fun (and scripted) to look forward to every week.\n",
      "summary": "60-minute Saturday bursts that lift pre-peak trade, use existing playlists, and feed straight into dinner bookings.",
      "date_published": "2025-11-20T00:00:00.000Z",
      "date_modified": "2026-02-25T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": ["theme hour", "power hour pub", "spin to win", "saturday promotions"],
      "image": "https://www.orangejelly.co.uk/images/blog/theme-hour-power-hour.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/epos-data-revenue-comeback",
      "url": "https://www.orangejelly.co.uk/licensees-guide/epos-data-revenue-comeback",
      "title": "Why Your EPOS Data Is the Key to a Revenue Comeback",
      "content_html": "\n# Why Your EPOS Data Is the Key to a Revenue Comeback\n\nYour EPOS already knows what sells, when it sells, and what actually makes money. The problem is most pubs stop at the Z report. A simple weekly routine turns data into action and action into revenue.\n\nThis is the minimum dashboard and experiment loop that works.\n\n## The four core metrics that matter\n\nTrack these every week:\n- **Covers** by day and time.\n- **Average spend per head**.\n- **Gross profit** by category.\n- **Labour percentage** by shift.\n\nIf you can see these four numbers, you can make better decisions immediately.\n\n## Build a one-page weekly dashboard\n\nKeep it simple. One page, same format, every week. Post it where the team can see it.\n\nExample sections:\n- Best and worst day by covers.\n- Top five items by margin.\n- Slow movers to remove.\n- One action for next week.\n\n## Run weekly experiments\n\nTreat each week as a small test. Change one thing and measure the result.\n\nExamples:\n- Move a high-margin item to the top of the menu.\n- Bundle a drink with a midweek dish.\n- Change a price point by one pound and track units.\n\nSmall tests beat big, random changes.\n\n## Segment your guests\n\nSplit data by time and occasion. A Friday night crowd is not the same as a Tuesday lunch. Build offers for each segment instead of averaging them together.\n\n## Spot hidden profit\n\nMany pubs have a quiet goldmine in one category. It could be premium soft drinks, desserts, or a specific spirit. Identify the top profit items and train the team to recommend them.\n\n## Share insights with the team\n\nNumbers are useless if only one person sees them. Share the weekly dashboard and agree one focus for the next seven days.\n\n## Common mistakes\n\n- Tracking too many metrics.\n- Making changes without measuring.\n- Ignoring labour cost by shift.\n- Leaving slow movers on the menu for months.\n\n## Quick checklist\n\n- One-page dashboard built.\n- Four core metrics tracked weekly.\n- One experiment run per week.\n- Top profit items promoted by staff.\n\n## Mini FAQ\n\n**Do I need complex software?**\nNo. A spreadsheet and your EPOS exports are enough.\n\n**How fast can data improve revenue?**\nOften within two weeks if you focus on one lever at a time.\n",
      "summary": "Transform EPOS reports into weekly action plans that boost covers, spend per head, and labour productivity.",
      "date_published": "2025-11-14T00:00:00.000Z",
      "date_modified": "2026-04-06T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": ["EPOS", "data", "analytics", "pub management", "performance"],
      "image": "https://www.orangejelly.co.uk/images/blog/epos-data-revenue-comeback.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/fizz-street-food-pop-up",
      "url": "https://www.orangejelly.co.uk/licensees-guide/fizz-street-food-pop-up",
      "title": "Friday Fizz or Street-Food Pop-Up Playbook",
      "content_html": "\n# Friday Fizz or Street-Food Pop-Up Playbook\n\nFriday is where the week either drifts into nothing or becomes the start of a huge weekend. A single trader partnership plus a fizz-led bundle keeps tills ringing while the kitchen preps for Saturday. Here’s the plug-and-play format we use at The Anchor when we want a lift without a full refit.\n\n## Quick Win Snapshot\n- **Prep time:** 3–4 hours total (menu sign-off, layout sketch, staff brief)\n- **Target headcount:** 60–90 covers in two waves (after-work + early evening)\n- **Margin maths:** £15–£18 bundle (small plate + spritz/AF serve) with healthy GP when shared with a trader on a 60/40 split\n- **Ops focus:** Station near the pass or consider an outdoor gazebo; one team member on host, another floating drinks QR orders\n\n## Pick a Format (Choose One and Stick for a Month)\n\n| Format | What it looks like | When to use it |\n| --- | --- | --- |\n| **Fizz Flight Station** | Trader serves three bite plates (e.g., arancini, bao, tacos) matched with fizz/spritz tasting flight | City centre, high female skew, Instagram crowds |\n| **Street-Food Takeover** | Guest chef uses your kitchen for 4× plated dishes, you handle drinks/puddings | When you’ve spare prep time between lunch & dinner |\n| **Courtyard Vendor Row** | One trailer parked outside + Aperol/AF spritz bar, standing tables | Wet-led pubs with limited kitchen capacity |\n| **Community Collab** | Local bakery, deli, or farm shop co-creates a “Friday hamper” served on boards | Villages/market towns with strong local supplier loyalty |\n\nRotate formats quarterly, not weekly. Consistency wins.\n\n## Partner Checklist (Copy-Paste into Your Outreach Email)\n1. **Menu scope:** 4 items max, priced as part of a fixed bundle. Include an AF dish and one vegan option.\n2. **Cost split:** Either wholesale their dishes and keep 100% of sales, or run a 60/40 till split (you keep the drinks, they keep food minus a service fee).\n3. **Branding:** Agree on co-branded table talkers + social tiles. You supply the spritz stack (house prosecco, premium mixer, AF sparkling).\n4. **Timeline:** Confirm menus by Monday, film prep clips by Wednesday, final headcount + delivery time by Thursday 3pm.\n5. **Paperwork:** Copy of their public liability insurance, EHO rating screenshot, allergen sheet in your folder.\n\n## Pricing and Bundles\n- **Hero bundle:** “£18 Small Plate + Spritz” or “£15 Plate + AF Spritz.” Include a £1 upgrade for premium top-ups.\n- **Add-on:** £5 dessert bite (mini cannoli / churros / brownie) from your kitchen so you still show off your menu.\n- **Retail tie-in:** Sell bottled cocktails or premix spritz kits to-go at £20 so guests take the vibe home.\n\n### Simple GP Formula\n`(Plate Cost + Spritz Cost + Labour Uplift) ÷ Desired Gross Profit = Bundle Price`. Keep labour uplift at a level that covers the extra host.\n\n## 90-Minute Run-Sheet (Per Wave)\n| Time | Action |\n| --- | --- |\n| T-60 | Trader set-up, power check, glassware polish, playlist switch |\n| T-30 | Staff briefing, allergen recap, soft-launch story on Instagram |\n| 00:00 | First arrivals greeted with tasters, host explains “order at QR or bar” |\n| 00:15 | Push bundle cards at tables, capture UGC shots |\n| 00:45 | Tray service to outdoor tables, check stock, post mid-event reel |\n| 01:20 | Last-call cue with “book next week” CTA |\n| 01:30 | Quick survey QR drop, log sales + feedback |\n\n## Marketing & Copy Blocks\n- **Email subject:** “This Friday: Bao & Blood Orange Spritz — 60 seats only.”\n- **Caption template:** “Friday Fizz Pop-Up • 5–8pm • Guest trader @handle • £18 plate + spritz (AF option) • Book via link.”\n- **Community Love:** Tag the trader, local market, plus tourism accounts; offer two comp bundles for micro influencers who cover the night.\n- **In-pub signage:** Clipboards with bundle photo + QR. Place at bar line and bathrooms by Wednesday.\n\n## Ops, Compliance, and Service Tips\n- Keep the trader’s kit outside the main kitchen to avoid cross-contamination. Use portable induction hobs or plan for cold service boards.\n- Log allergens yourself, do not rely on “see trader.” Provide laminated cheat-sheets at the till.\n- Separate till buttons for Bundle vs À la carte so you can see actual uptake.\n- If licensing covers only your staff serving alcohol, station a team member next to any fizz taps that the trader touches.\n- Post-event deep clean the borrowed area immediately; send trader a thank-you + next open date within 12 hours.\n\n## Metrics to Track\n| KPI | Target | Tool |\n| --- | --- | --- |\n| Bundle uptake | Majority of orders | Till mix report |\n| Incremental spend/head | Lift vs standard Friday 5–8pm | Compare POS vs last four Fridays |\n| New faces vs regulars | Healthy share of new faces | Booking form tag |\n| Social reach | Noticeable lift in Friday story views | Instagram insights |\n\n## Mini FAQ\n**Do I need a TEN?** If the trader cooks similar food and you’re within normal hours, no. Need a TEN only if trading outside licensed hours or using outdoor space beyond your plan.\n\n**What if the trader bails?** Always keep a house-led “Plan B” board (cheese + charcuterie) so you can still honour bookings with a fizz bundle.\n\n**How do I keep service aligned with the main kitchen?** Stagger pop-up pick-up times with 10-minute windows and route all orders through a single host so chefs see consolidated tickets.\n\n**How can I involve suppliers?** Ask your prosecco or mixer rep for POS, free stock, or comp glasses in exchange for tagging them in reels and featuring their pour in the bundle description.\n\nNail one format, promote it like a weekly ritual, and Friday pop-ups become the reason locals clock off early to see you first.\n",
      "summary": "Turn the handover from after-work drinks into a sell-out street-food takeover with bundled spritz menus, partner-ready checklists, and ops flows built for stretched teams.",
      "date_published": "2025-11-13T00:00:00.000Z",
      "date_modified": "2026-02-25T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": ["friday night pub ideas", "street food takeover", "spritz bundles", "pub events"],
      "image": "https://www.orangejelly.co.uk/images/blog/fizz-street-food-pop-up.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/energy-bill-shock-cut-venue-costs",
      "url": "https://www.orangejelly.co.uk/licensees-guide/energy-bill-shock-cut-venue-costs",
      "title": "Energy Bill Shock? Immediate Ways to Cut Venue Costs",
      "content_html": "\n# Energy Bill Shock? Immediate Ways to Cut Venue Costs\n\nEnergy spikes can erase profit in a single quarter. The fastest win is not a big retrofit, it is a focused 30-day plan that fixes usage, maintenance, and habits. You can cut costs without turning the pub into an ice box.\n\n## Step 1: Run a 7-day energy audit\n\nTrack daily usage at the same time each day. Note what was running and when. You will usually find two or three waste points within a week.\n\nSimple wins often include:\n- Heating on too early.\n- Fridges running empty.\n- Lights left on in closed rooms.\n\n## Step 2: Service the workhorses\n\nBoilers, fridges, and cellar cooling are your biggest energy users. A service and clean can cut usage quickly. Dirty filters and blocked vents cost money every day.\n\n## Step 3: Automate the boring stuff\n\nTimers and smart thermostats remove human error. If you rely on memory, you will lose.\n\nPriority upgrades:\n- Heating zones and timers.\n- Motion sensors in storage areas.\n- Auto shut-off on external signage.\n\n## Step 4: Switch tariffs strategically\n\nReview your contract and compare rates. Even a small shift can save meaningful money at scale.\n\nIf you are locked in, focus on usage. If you are flexible, shop around now.\n\n## Step 5: Engage the team\n\nBehaviour change matters. One person leaving a beer cellar door open can undo all your savings.\n\nUse a short weekly reminder:\n- Close doors properly.\n- Turn off unused equipment.\n- Report faulty seals.\n\n## Step 6: Invest where it pays back\n\nNot all upgrades are expensive. LED lighting, draught proofing, and modern fridge seals often pay back within months.\n\n## Common mistakes\n\n- Cutting heating too far and hurting the guest experience.\n- Investing in big upgrades before fixing daily waste.\n- Failing to track weekly usage.\n\n## Quick checklist\n\n- 7-day usage log complete.\n- Boilers and fridges serviced.\n- Timers installed on key systems.\n- Team briefed on energy habits.\n\n## Mini FAQ\n\n**Should I shut off areas of the pub?**\nOnly if it improves atmosphere. Closing a cold, empty section can help if it concentrates energy.\n\n**How quickly can savings appear?**\nMost pubs see measurable changes within 30 days if the audit is consistent.\n",
      "summary": "Slash utility bills within 30 days by tightening maintenance, behaviour, and supplier contracts.",
      "date_published": "2025-11-07T00:00:00.000Z",
      "date_modified": "2026-03-09T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": ["energy costs", "utilities", "sustainability", "cost control", "pub operations"],
      "image": "https://www.orangejelly.co.uk/images/blog/energy-bill-shock-cut-venue-costs.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/quiz-night-101",
      "url": "https://www.orangejelly.co.uk/licensees-guide/quiz-night-101",
      "title": "Quiz Night 101: Licensee Guide",
      "content_html": "\n# Quiz Night 101: Plan, Host and Grow a Brilliant Weekly Quiz\n\nQuiet Tuesdays don’t have to stay that way. A well-run pub quiz keeps regulars loyal, gives newcomers an easy first visit, and delivers a predictable midweek bump for the bar. This guide walks you through every element: format, staffing, question writing, marketing, accessibility, compliance, and the numbers you should track afterwards.\n\n> **At-a-glance checklist**\n> - ☐ Rounds scripted & printed  \n> - ☐ Pens, answer sheets, float ready  \n> - ☐ Playlist and audio clips tested  \n> - ☐ Mic levels set  \n> - ☐ Tie-break question prepared  \n> - ☐ Prize list agreed  \n> - ☐ Social posts scheduled  \n> - ☐ Leaderboard updated\n\n## What Makes a Quiz Night Work\n\nSuccessful quiz nights share six traits:\n\n1. **Clear format.** Five to six rounds, 8–10 questions each, 90–120 minutes total. Everyone knows when the breaks are and how scoring works.\n2. **Consistency.** Same day, time, and host tone each week so guests build the quiz into their routine.\n3. **Pacing.** Rounds last 12–15 minutes with five-minute breaks for the bar; background tunes return between rounds to keep atmosphere up.\n4. **Fairness.** Difficulty spreads from easy warm-up to tough tie-break, with a mix of subjects so no team feels excluded.\n5. **Atmosphere.** Lighting lowered but readable, music at conversational level pre/post rounds, mic levels matched to room size.\n6. **Community.** Team names read aloud, birthdays acknowledged, leaderboards posted online or on the chalkboard next day.\n\n## Choose Your Format\n\nMost pubs rotate between a classic mixed quiz, themed nights, and interactive rounds to keep things fresh without rewriting the rulebook.\n\n### Core structures\n\n| Round | Focus | Notes |\n| --- | --- | --- |\n| Warm-Up | General knowledge | 10 questions to build confidence. |\n| Music | 10–20s audio clips | Name artist/title; note the year for bonus. |\n| Pictures | Logos, landmarks, famous faces | Print A4 sheets or display on TVs. |\n| Specialist | Science, literature, sport | Rotate weekly; announce ahead of time. |\n| Connections | Five clues + final link | Nod to \"Only Connect\" fans. |\n| Speed Round | 60-second quick-fire | Each team answers privately; perfect near the end. |\n| Tie-break | Nearest number | E.g., exact population of Staines-upon-Thames. |\n\n**Theme nights** (90s club classics, Christmas cracker, local history, TV & Film) bring in new audiences, but keep a classic mix every other week so regulars aren’t alienated.\n\n### Interactive ideas\n\n- Pictionary or charades on a flip chart.\n- Mystery box item passed around under cloth.\n- “Closest-to” cards for estimated answers—collect at end for fun stats.\n- Playlist battle where two teams submit playlists and the room votes during breaks.\n\n## Scoring and Fair Play\n\n- **Marking:** swap answer sheets with neighbouring tables and mark as you announce answers. The host collects and logs scores to avoid disputes.\n- **Bonus points:** award one bonus for best team name or for teams who share a photo and tag the venue.\n- **Anti-cheat measures:** remind teams about phones away, position staff to notice suspicious play, and keep prizes fun rather than overly valuable.\n- **Leaderboard:** maintain a Google Sheet or chalkboard with cumulative points. Offer a monthly playoff for bragging rights instead of giant prizes.\n\n## Roles and Run-of-Show\n\nEven if you’re a one-person band, list the hats you’re wearing. Ideally:\n\n- **Host/Quizmaster:** writes or curates rounds, controls pacing, handles patter.\n- **Scorekeeper/Runner:** collects sheets, totals scores, keeps leaderboard tidy.\n- **Sound tech:** sets mic/speaker balance, triggers music/audio rounds.\n- **Front-of-house:** pushes bundles during breaks, reserves tables, handles entry fees.\n\n**Sample timeline (doors 19:00, quiz 19:30–21:20):**\n\n| Time | Segment | Notes |\n| --- | --- | --- |\n| 19:30 | Welcome & rules | Plug bundles, remind no phones. |\n| 19:40 | Round 1 – Warm-Up | 10 Qs. |\n| 19:55 | Scoring break | Swap sheets, collect, announce top 3. |\n| 20:00 | Round 2 – Music | Play clips via laptop/phone; cue volume lower than voice. |\n| 20:15 | Break | Push bar snacks, capture stories. |\n| 20:20 | Round 3 – Pictures | Display via TV/projector or printed sheets. |\n| 20:35 | Round 4 – Specialist | Announce next week’s theme mid-round. |\n| 20:50 | Round 5 – Connections + Speed | Combination keeps energy up. |\n| 21:10 | Tie-break + winners | Present prizes, take photos, trail next quiz. |\n\n## Kit and Setup\n\n| Item | Why you need it | Tip |\n| --- | --- | --- |\n| PA/speaker + mic | Ensure every table hears clearly | Test before doors open; keep mic gain low. |\n| Laptop/tablet | Run music/picture rounds | Download files offline in case Wi-Fi fails. |\n| HDMI cable / Chromecast | Display picture rounds | Label cables and test with house TVs. |\n| Printed answer sheets | Faster marking | Include team name, contact email, tie-break line. |\n| Pens/pencils | No fumbling | Keep extras behind bar. |\n| Float | Entry fees/charity donations | Note start/end totals for reconciliation. |\n\n**Budget guide:** £0–£150 for prizes (bar tabs, merch), £20–£60 printing, £50–£200 if hiring an external host.\n\n## Questions People Love (with examples)\n\n- **Local flavour:** “What river separates Staines from Egham?” (Answer: River Thames.)\n- **Soundbites:** play the first second of “Common People”—ask for artist + album year.\n- **Picture clue:** zoomed-in shot of a Greene King pump clip.\n- **Connections:** Q1 “Haddock”, Q2 “Puffin”, Q3 “Gannet”, Q4 “Fulmar”, Q5 “Tern” → Connection: all birds on UK postage stamps.\n- **Closest-to tie-break:** “How many casks does the average Greene King managed pub sell per week?”\n\nAim for a 60/30/10 mix (easy/medium/tricky). Keep a spreadsheet tagging each question by topic so you don’t repeat within eight weeks.\n\n## Prizes That Drive Return Visits\n\n- £20–£30 bar tab.\n- Local collaborator voucher (butcher, florist, barber)—low cost, cross-promo.\n- Rolling jackpot jar (capped under £50 to avoid gambling implications).\n- Booby prize: pickled egg, bag of crisps, or pub-branded wooden spoon for last place.\n\n## Marketing Plan (four-week cadence)\n\n| Timeline | Actions |\n| --- | --- |\n| Week –4/–3 | Create Facebook event, update Google Business Profile, design posters/chalkboard. |\n| Week –2 | Share reel of last week’s laughter; drop teaser question. |\n| Week –1 | DM loyal teams with booking link; push email to newsletter. |\n| Day –1 | Stories countdown, playlist sneak peek, remind of bundle offer. |\n| Day 0 | Go Live post at noon + Stories from setup. |\n| Day +1 | Publish winners photo (with consent), plug next date. |\n\n**Copy-ready post:** “Quiz Night is back Tuesday, 7.30pm. £2pp, max 6 per team, prizes + bragging rights. Book now 👉 [link].”\n\n## Accessibility and Inclusion\n\n- Offer large-print answer sheets (14pt+ font) on request.\n- Repeat each question twice and display picture/keyword slides where possible.\n- Keep aisles clear for sheet collection; provide chairs without high stools for mobility needs.\n- Avoid culturally specific jokes or references unless you explain them.\n\n## Compliance Corner: Music Licensing\n\nIf you play recorded music (audio clips, walk-in playlists) or host live performance, you’ll usually need **TheMusicLicence** from PPL PRS, which covers both PRS for Music and PPL permissions. Confirm your venue’s licence and keep documentation handy. More information: [PPL PRS](https://pplprs.co.uk/themusiclicence/).\n\n## Metrics and Post-Event Debrief\n\nTrack these four numbers weekly:\n\n| Metric | Target | Notes |\n| --- | --- | --- |\n| Headcount / teams | Noticeable lift vs baseline | Log new vs repeat teams. |\n| Average spend per head | Healthy | Compare bundle vs à-la-carte. |\n| Dwell time | Long enough to drive bundles | Longer suggests bundles working. |\n| Next-week pre-book | Strong | Use QR or quick show of hands. |\n\nDebrief with staff within 12 hours: Which rounds landed? Any tech wobbles? Did we capture content? Who’s on hosting duty next week?\n\n## FAQs\n\n**How much prep time should I budget each week?** Once the format is locked, plan 60–90 minutes to refresh question banks, schedule socials, and print sheets; batch four weeks at a time to cut that in half.  \n**Do I need extra licensing for the music round?** Yes—recorded clips normally require **TheMusicLicence** (PPL PRS). Confirm your venue’s coverage before advertising audio rounds.  \n**Is it better to charge entry or bundle?** Bundles (£10 entry + drink + snack) drive higher spend and make reporting easier; switch to a suggested donation only if your demographic resists paying.  \n**What if attendance is slow for the first month?** Keep the slot going for at least four weeks, share photos even if turnout is small, and personally invite known regulars; consistency builds momentum.  \n**What metrics should I share with my BDM or owner?** Track headcount, average spend, dwell time, and next-week bookings so you can evidence uplift versus a normal Tuesday.\n\n## Need backup?\n\nTap the sticky “Get in Touch” button on orangejelly.co.uk or email `peter@orangejelly.co.uk` if you want a co-host briefing, question bank refresh, or on-site support.\n",
      "summary": "Step-by-step playbook for running a 90-minute pub quiz that feels hyper-local, stays compliant, and fills the till every week.",
      "date_published": "2025-11-06T00:00:00.000Z",
      "date_modified": "2025-11-06T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": ["pub quiz guide", "quiz night ideas", "licensee toolkit", "rhythm of the week"],
      "image": "https://www.orangejelly.co.uk/images/blog/quiz-night-101.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/email-marketing-pub-retention",
      "url": "https://www.orangejelly.co.uk/licensees-guide/email-marketing-pub-retention",
      "title": "Email Marketing for Pubs: Build a Database That Drives Repeat Business",
      "content_html": "\n# Email Marketing for Pubs: Build a Database That Drives Repeat Business\n\nA great visit means nothing if you never see the guest again. Email gives you a direct way to bring people back without paying for ads every time. The key is to keep it simple and consistent.\n\n## Step 1: Build the list the right way\n\nUse opt-in forms, booking checkboxes, and in-pub QR cards. Do not buy lists. You want locals who actually visit.\n\n## Step 2: Create a welcome sequence\n\nA short welcome series sets expectations and drives the second visit.\n\n- Email 1: thank you and a warm welcome.\n- Email 2: highlight your signature offer.\n- Email 3: invite them to a specific event.\n\n## Step 3: Choose a weekly rhythm\n\nMost pubs do well with one weekly email:\n- Whats on this week.\n- A simple offer.\n- A clear booking link.\n\n## Step 4: Segment lightly\n\nYou only need two or three segments:\n- Regulars.\n- Event attendees.\n- Families or lunch guests.\n\nSegmentation helps you keep messages relevant.\n\n## Step 5: Measure the basics\n\nTrack:\n- Open rate.\n- Clicks to booking.\n- Actual bookings.\n\nIf bookings rise, the email is working.\n\n## 90-day plan\n\n- Month 1: build the list and welcome series.\n- Month 2: establish weekly rhythm.\n- Month 3: segment and test two offers.\n\n## Common mistakes\n\n- Sending too many emails.\n- No clear CTA.\n- Writing long newsletters nobody finishes.\n\n## Quick checklist\n\n- Opt-in active in the pub and online.\n- Welcome sequence written.\n- Weekly email scheduled.\n- Clicks and bookings tracked.\n\n## Mini FAQ\n\n**How big does the list need to be?**\nEven 200 engaged locals can move a quiet night.\n\n**Should I send discounts?**\nUse added value or priority booking rather than constant discounts.\n",
      "summary": "Turn one-time visitors into regulars with email marketing that works. Learn list building, automation, and campaign strategies that keep customers coming",
      "date_published": "2025-10-31T00:00:00.000Z",
      "date_modified": "2025-05-12T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": [
        "email marketing for pubs",
        "pub customer retention",
        "pub marketing ideas",
        "customer database",
        "retention marketing"
      ],
      "image": "https://www.orangejelly.co.uk/images/blog/email-marketing-pub-retention.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/music-bingo-101",
      "url": "https://www.orangejelly.co.uk/licensees-guide/music-bingo-101",
      "title": "Music Bingo 101: Licensee Guide",
      "content_html": "\n# Music Bingo 101: Cards, Playlists, Hosting and Prizes\n\nSwap numbers for nostalgia, and you’ve got the easiest crowd-pleaser in your events calendar. Music bingo lets guests mark off song titles instead of digits, meaning zero marking for staff, plenty of singalongs, and a format you can theme endlessly. This guide covers card creation, playlists, run-sheets, prizes, marketing, accessibility, and compliance so you can launch within a week.\n\n## Choose Your Theme and Audience Fit\n\nMusic bingo thrives when the soundtrack matches your crowd and timeslot.\n\n- **After-work Aperitivo (Thursdays):** 80s synth, Britpop, indie disco.\n- **Family Sunday:** Disney bangers, musical theatre, film soundtracks.\n- **Student night:** TikTok viral hits, 00s R&B throwbacks.\n- **Seasonal specials:** Festive classics, Eurovision history, Pride anthems.\n\nRotate the headline theme every fortnight but keep a consistent night/time so regulars know when to return.\n\n## Card Creation (Analogue and Digital)\n\nMost venues keep it tactile with printed cards—simple 5×5 grids containing song titles or artists. Aim for 40–60 unique cards per theme so neighbouring tables don’t duplicate.\n\n1. Build a master tracklist of 60–80 songs in a spreadsheet.\n2. Randomise the order using `=RAND()` and distribute evenly across grids.\n3. Label each card (A01, A02…) so winners are easy to verify.\n4. Print on 160gsm paper for durability; laminate if you plan to reuse with dry-wipe pens.\n\n**Digital option:** tools like MyFreeBingoCards or Bingo Baker allow QR-access cards. Great for hybrid events, but ensure Wi-Fi is stable and provide a few printed backups for guests who prefer paper.\n\n## Playlist and Cue Crafting\n\n- **Clip length:** 15–25 seconds is plenty—long enough for recognition, short enough to keep momentum.\n- **Transitions:** preload the playlist in Spotify/Apple Music/DJ software with 2-second crossfades to avoid dead air.\n- **Host cues:** before each clip ask, “Markers ready?” and after each track state “That was *Freed from Desire* by Gala—mark it if it’s on your card.” This helps guests who didn’t recognise the song by ear.\n\n### Theme rotation idea\n\n| Week | Theme | Anchor tracks |\n| --- | --- | --- |\n| 1 | 90s Dancefloor Fillers | Gala, Livin’ Joy, Faithless |\n| 2 | British Icons | Oasis, Amy Winehouse, Stormzy |\n| 3 | Movie Night | Guardians mix, Dirty Dancing, Barbie |\n| 4 | Girl Bands vs Boy Bands | Little Mix, Westlife, Sugababes |\n\n## Rules and Rounds\n\nA standard night runs three games of increasing stakes:\n\n1. **Game 1:** One line (horizontal/vertical). Small prize.\n2. **Game 2:** Two lines. Slightly larger prize.\n3. **Game 3:** Full house. Main prize.\n\nWinners shout “BINGO!”—host pauses music, verifies card versus the master list, and restarts after a quick photo.\n\n**Tie-break suggestion:** keep a spare “guess the intro” clip. First player to name artist and title wins.\n\n## Hosting and Energy\n\n- Keep patter short and upbeat. Think “singalong MC” rather than stand-up comic.\n- Encourage table choreography (claps, napkin waves). Offer a bonus drink token for the best dance move caught on stories.\n- Use a winners board or Polaroid line so returning guests feel part of the club.\n\n## Run-of-Show (90 Minutes)\n\n| Time | Action | Detail |\n| --- | --- | --- |\n| 00:00–00:05 | Welcome & rules | Explain how to mark cards, demonstrate dabber use, highlight prizes. |\n| 00:05–00:30 | Game 1 | 25 tracks; award single-line and double-line prizes. |\n| 00:30–00:40 | Break | Push sharing plates, capture Reel, trail next theme. |\n| 00:40–01:05 | Game 2 | Switch playlist to keep energy up; offer optional “dance-off” bonus. |\n| 01:05–01:10 | Encore mini-game | First to guess three intros wins shot/AF mocktail tokens. |\n| 01:10–01:15 | Game 3 finale & wrap | Full house prize, group photo, plug bookings. |\n\n## Kit and Setup\n\n| Item | Why | Tip |\n| --- | --- | --- |\n| Laptop/tablet | Playlist + master tracklist | Download playlists offline. |\n| PA/speaker + mic | Keep energy high | Test speech vs music volume pre-doors. |\n| Printed cards/dabbers | Core mechanic | Colour-code by game to avoid mix-ups. |\n| Prize stash | Lines + full house | Include non-alcoholic options. |\n| Float / card reader | Optional entry fee or bundles | Mark all sales through the till for reporting. |\n\n**Budget snapshot:** £30–£60 printing, £50–£150 prizes, optional host fee £100–£250, plus staff hours.\n\n## Marketing Playbook\n\n- **Visual identity:** retro gradients, big typography (“Sing. Mark. Win.”).\n- **Teasers:** ask followers to guess three blurred song titles for a free entry.\n- **Copy-ready caption:** “Music Bingo drops Thursday 7.30pm 🎶 Free to play, prizes every round, bookings recommended 👉 [link].”\n- **Day-of stories:** show card stacks, dabbers lined up, playlist screenshot.\n\nCross-link to your Quiz Night 101 article for guests who also love trivia, and to Karaoke Night 101 for those chasing mic time.\n\n## Accessibility and Inclusion\n\n- Offer large-print cards and pens with chunky grips.\n- Provide a printed list of songs played after each round so deaf or hard-of-hearing guests can check their cards.\n- Keep a few tables closer to the speakers for those who rely on audio cues, while offering low-volume corners for sensory-sensitive guests.\n\n## Compliance Corner\n\nMusic bingo uses recorded tracks, so ensure your venue holds **TheMusicLicence** (PPL PRS) covering public performance of recorded music. If you charge for entry or offer cash-equivalent prizes, check local licensing guidance to confirm you’re running a promotional activity rather than regulated gambling. Useful starting points: [PPL PRS](https://pplprs.co.uk/themusiclicence/) and [Gambling Commission guidance](https://www.gamblingcommission.gov.uk/guidance/guidance-to-licensing-authorities/part-18-bingo-in-clubs-and-alcohol-licensed-premises).\n\n## Metrics to Track\n\n| KPI | Target | How to capture |\n| --- | --- | --- |\n| Cards issued | High share of available seats | Count per game. |\n| Bundle uptake | Strong | Use till buttons. |\n| Social tags | Steady nightly posts | Re-share to encourage more. |\n| Repeat attendance | Strong within a month | Quick QR survey or booking log. |\n\nAsk the team the next morning: Which tracks landed? Did we run out of dabbers? Did the break feel long enough? Capture ideas for next week’s theme.\n\n## FAQs\n\n**How many unique cards and tracks do I really need?** For a 60-person room plan 40–60 distinct cards and a 60–80 track playlist; reuse the template but reshuffle for each theme.  \n**Do I need an extra licence beyond my existing music licence?** Usually TheMusicLicence (PPL PRS) covers music bingo, but double-check your account includes recorded music for events and keep proof on file.  \n**Can I run it with just one staff member?** Ideally have a host/MC plus a floor runner to verify wins and push bundles; solo hosting works only in very small venues.  \n**What’s the best way to monetise if entry is free?** Promote pre-booked tables with sharer platters, sell “dabber + drink” bundles, and capture emails for future promotions.  \n**How often should I rotate themes?** Change the headline theme every 2–3 weeks so regulars feel variety without forcing you to rebuild assets weekly.\n\n## Need backup?\n\nTap the sticky “Get in Touch” button on orangejelly.co.uk or email `peter@orangejelly.co.uk` for playlist curation, MC coaching, or bespoke card builds.\n",
      "summary": "Hybrid quiz/karaoke toolkit with playlists, Canva cards, and MC tips so you can run 90-minute music bingo nights without marking.",
      "date_published": "2025-10-30T00:00:00.000Z",
      "date_modified": "2025-11-06T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": ["music bingo", "pub events toolkit", "licensee guide", "midweek mixer"],
      "image": "https://www.orangejelly.co.uk/images/blog/music-bingo-101.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/double-drinks-profit-without-selling-more",
      "url": "https://www.orangejelly.co.uk/licensees-guide/double-drinks-profit-without-selling-more",
      "title": "Your Drinks Are Making Half The Profit They Should - Here's The Fix",
      "content_html": "\nYou're working twice as hard as you need to for half the profit you deserve.\n\nLast week, I watched a licensee celebrate selling a wall of pints on a busy Friday. Great volume, packed pub, exhausted staff. His profit was modest. Meanwhile, the coffee shop next door made similar profit from far fewer serves, with one part-time staff member.\n\nHere's the painful truth: if you're focusing on shifting more pints to increase profit, you're playing a game you can't win. The chains will always beat you on volume. But there's a different game entirely - one where a single cocktail sale can outperform multiple pints, where coffee becomes a steady revenue stream, and where your existing customers happily spend more without you serving a single extra person.\n\n## The Real Problem\n\n**Your drinks menu is stuck in 1995 while your costs are firmly in 2025.**\n\nStandard lager runs on thinner margins than most people realise. After wage and tax rises, that margin can shrink to almost nothing. You can't raise pint prices much more - customers are already sensitive. You can't cut costs further without compromising quality.\n\nBut here's what nobody talks about: while you're battling over pint prices, Wetherspoons quietly sells 50 million coffees a year. While you're discounting lager to compete, the gastropub down the road makes £15 profit on every cocktail. While you're worried about losing regulars, they're already buying premium drinks elsewhere.\n\nThe solution isn't selling more. It's selling smarter.\n\n## The Premium Profit Multiplication Effect\n\nLet me show you the comparison that changed everything at The Anchor:\n\n**Standard Pint:**\n- Lower margin, high volume\n\n**Premium Coffee:**\n- Higher margin, fast to serve\n\n**Classic Cocktail:**\n- Highest margin, strong perceived value\n\nThe takeaway: premium drinks can outperform multiple pints in profit. They take less time to serve, create less mess, and customers expect to pay more for them.\n\n## Your Five-Step Premium Transformation\n\n### Step 1: The Coffee Revolution (Week 1)\n\nForget everything you think about being \"just a pub.\" Every single customer who walks through your door drinks coffee somewhere. Why not with you?\n\n**The Setup:**\n- Bean-to-cup machine: entry-level or leased\n- Coffee beans: buy in bulk\n- Training: short session with your supplier\n\n**The Numbers:**\n- A small daily volume creates meaningful revenue\n- Margins are strong when you price for value\n\nI started with morning coffee for the dog walkers. Then the lunch crowd wanted americanos with their sandwiches. Now we sell Irish coffees in the evening and espresso martinis at night. One machine, four revenue streams.\n\n### Step 2: The Soft Drink Revolution (Week 2)\n\nPremium soft drinks carry strong margins and zero training requirements. Fever-Tree, Fentimans, local craft sodas - they practically sell themselves.\n\n**Quick Implementation:**\n- Stock 5 premium mixers (£1 cost, £3.50 sale)\n- Add 3 craft sodas (£0.80 cost, £3 sale)\n- Feature fresh juices (£0.50 cost, £2.50 sale)\n\nWhen someone orders a gin and tonic, never ask \"which tonic?\" Ask \"Mediterranean or elderflower?\" You've just added £2 to the sale with three words.\n\n### Step 3: The Five-Cocktail System (Week 3)\n\nYou don't need 50 cocktails. You need five good ones made consistently.\n\n**The Profitable Five:**\n1. **Espresso Martini** - Coffee machine crossover, £9\n2. **Gin Garden** - Premium gin showcase, £8.50\n3. **Rum Punch** - Batch-made efficiency, £8\n4. **Whiskey Sour** - Classic appeal, £8.50\n5. **Mocktail Special** - Inclusive option, £5\n\nCost: £2 average. Sale: £8 average. Profit: £6 per drink.\n\nTrain one confident staff member first. They become your cocktail champion, teaching others and suggesting serves. Confidence sells more than competence.\n\n### Step 4: The Premium Spirit Shelf (Week 4)\n\nYou already have spirits. Now make them work harder.\n\n**The Strategy:**\n- Position premium spirits at eye level\n- Create tasting notes for staff (index cards work)\n- Offer 25ml tasters for £2 (builds confidence)\n- Bundle with mixers: \"Hendricks and Mediterranean tonic for £7\"\n\nOne premium spirit sale weekly from each staff member adds £5,000 annually. That's a 10-second upsell worth five grand.\n\n### Step 5: The Multiplication Method (Ongoing)\n\nHere's where profits really explode - getting customers to buy premium drinks *in addition* to their usual, not instead of.\n\n**The Approach:**\n- \"Start with bubbles?\" - Prosecco before dinner\n- \"Coffee with dessert?\" - After meal addition\n- \"One for the road?\" - Premium nightcap\n- \"Try our new...\" - Sample with purchase\n\nThis isn't upselling. It's offering experiences. The couple having a meal and two pints becomes a meal, prosecco, two pints, and coffee. Same visit, double the profit.\n\n## Your Action Plan\n\n### Week 1: Foundation\n- Monday: Order coffee machine (or arrange lease)\n- Tuesday: Stock 5 premium soft drinks\n- Wednesday: Train staff on coffee (supplier usually does this free)\n- Thursday: Create simple drinks menu cards\n- Friday: Launch with free coffee samples (9-11am)\n- Weekend: Track every premium sale\n\n### Week 2: Momentum\n- Add cocktail ingredients for your five classics\n- Run staff tasting session (they sell what they know)\n- Create table talkers about new drinks\n- Start suggesting specific drinks, not asking \"what would you like?\"\n- Introduce \"Coffee & Cake\" afternoon deal\n\n### Week 3: Expansion\n- Launch cocktail happy hour (quiet period only)\n- Add premium spirits shelf display\n- Create \"drink of the week\" to build habit\n- Partner with local businesses for morning coffee\n- Track profit per customer, not just sales\n\n### Week 4: Embedding\n- Review what's working, drop what isn't\n- Reward staff for premium sales (£1 per cocktail sold?)\n- Add seasonal specials (mulled wine, iced coffee)\n- Create loyalty card for coffee\n- Calculate your profit increase\n\n## Results You Can Expect\n\n### Immediate (Week 1)\n- Early profit from coffee sales\n- Noticeable lift in spend per head\n- Surprised reactions: \"You do coffee? Brilliant!\"\n\n### Month 1\n- Meaningful additional profit\n- New customer segments (morning coffee crowd)\n- Staff excitement about selling something different\n\n### Month 3\n- Strong additional profit\n- Coffee/cocktails become a clear share of wet sales\n- Reputation shift: \"That pub with great coffee\"\n\n### Month 6\n- Significant additional profit\n- Premium drinks embedded in culture\n- Customers choosing you FOR premium drinks\n\nAt The Anchor, our wet sales profit improved without serving a single extra customer. Same footfall, transformed margins. The coffee machine paid for itself quickly. The cocktail training took one afternoon. The premium spirits were already on our shelf - we just started talking about them.\n\n## Common Objections Solved\n\n**\"My customers won't pay premium prices\"**\nThey already do, just not at your pub. They buy Costa coffee, Gordon's pink gin at home, and cocktails on special occasions. Give them permission to do it with you.\n\n**\"I don't have time for complicated drinks\"**\nPulling a coffee takes 30 seconds. Pouring premium tonic instead of standard takes zero extra time. Batch-made cocktails are faster than changing a barrel.\n\n**\"What if nobody buys them?\"**\nCoffee beans last months. Spirits don't expire. Premium mixers have long dates. Your risk is minimal, your upside unlimited. Start small, grow with demand.\n\n**\"My staff won't be able to sell them\"**\nThey don't need to be baristas or mixologists. They need one script: \"Our new [specific drink] is gorgeous with that.\" Specific suggestions sell. Vague questions don't.\n\n## The Bottom Line\n\nYou're already working hard enough. Every shift, every service, every late night dealing with difficult customers. The answer isn't working harder or serving more people. It's making every sale count more.\n\nTomorrow morning, just try this: instead of asking \"Tea or coffee?\" ask \"Cappuccino or americano?\" Instead of \"Which gin?\" suggest \"The Hendricks is beautiful with cucumber.\" Instead of taking the order, recommend something specific.\n\nThese tiny changes compound into transformation. One premium drink per hour across your opening times is £30,000 in annual profit. That's not from new customers or longer hours or price rises. That's from serving what you already have, better.\n\nThe chains compete on price and volume. You can't win that game. But premium experience? Personal recommendation? Quality over quantity? That's your game. And it's worth twice the profit.\n\nStart with coffee tomorrow morning. By next month, you'll wonder why you didn't do this years ago.\n\nBecause here's the truth: your customers want to spend more with you. They just need permission, options, and confidence you'll deliver. Give them all three, and watch your profits transform without selling a single extra pint.\n",
      "summary": "Most pubs leave meaningful money on the table annually by focusing on volume instead of margin. Learn the premium shift that transforms your profits.",
      "date_published": "2025-10-24T00:00:00.000Z",
      "date_modified": "2025-10-24T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": [
        "Drinks Strategy",
        "Profit Margins",
        "Premium Products",
        "Coffee Sales",
        "Cocktails"
      ],
      "image": "https://www.orangejelly.co.uk/images/blog/double-drinks-profit-without-selling-more.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/karaoke-night-101",
      "url": "https://www.orangejelly.co.uk/licensees-guide/karaoke-night-101",
      "title": "Karaoke Night 101: Licensee Guide",
      "content_html": "\n# Karaoke Night 101: Plan, Host and Grow a Singalong Hit\n\nKaraoke is still the cheapest way to pack a Thursday. Give regulars the mic, capture TikTok-friendly content, sell bundles while they wait to sing, and you’ve got a repeatable anchor night. This guide covers formats, equipment, hygiene, queue management, marketing, safeguarding, and compliance.\n\n## Format Options\n\n| Format | When to use | Notes |\n| --- | --- | --- |\n| Open mic rota | Most weeknights | Continuous queue; works for mixed crowds. |\n| Showcase sets | Busy Fridays | Three themed blocks (e.g., Girl Bands vs Boy Bands) with breaks in between. |\n| Team karaoke | Corporate/community bookings | Groups compete with judges or crowd voting. |\n| Random wheel | Students/hen nights | Spin for surprise song; keep host ready with veto list. |\n\nDecide whether the host also sings to warm the room—great in quieter periods, less necessary when you’ve already got a queue.\n\n## Equipment and Sound\n\n| Item | Spec | Why |\n| --- | --- | --- |\n| Microphones | 2x dynamic wireless + 1 wired backup | Wireless lets singers move; wired backup saves the night. |\n| Mixer/audio interface | 4+ channels with EQ and reverb | Balance backing track vs vocals. |\n| Speakers/monitor | FOH + wedge monitor or in-ears | Prevent feedback, help singers pitch. |\n| Playback device | Laptop/tablet with licensed karaoke software (e.g., KaraFun Business) | Instant key changes, large catalogue, offline playlists. |\n| Display | TV/projector with HDMI | Lyrics visible from anywhere. |\n| Lighting | Simple LED bars or par cans | Creates stage vibe without blowing budget. |\n| Hygiene kit | Disposable mic covers, wipes, hand gel | Swap covers every singer; wipe stands hourly. |\n\nBefore doors open, run a full soundcheck with your loudest backing tracks and quietest singers to set conservative gain levels. Add light reverb so vocals sit with the track but keep it subtle.\n\n## Songbooks and Discovery\n\n- Host a digital catalogue: QR code on every table linking to a searchable sheet sorted by artist, decade, difficulty.\n- Print a “good first songs” list (Wonderwall, Valerie, Proud Mary, Mr Brightside) for nervous newbies.\n- Curate rotating playlists (00s Week, Pride Playlist, Brit Awards special) and announce themes ahead of time to drive bookings.\n\n## Queue Management and Stagecraft\n\n1. **Sign-ups:** Use slips or a QR form capturing name, song, key change, duet request. Display the running order on TV so nobody feels skipped.\n2. **Time limits:** Cap songs at 3m30s; fade gracefully if someone goes long.\n3. **Rotation fairness:** Alternate between newcomers and regulars; allow one song per person per round.\n4. **Host patter:** 10–15 second intro, highlight celebratory moments (birthdays, hen dos), and remind the crowd to cheer.\n5. **Stage rules:** No swinging mics, drinks stay off stage, escorts for kids if you run daytime family karaoke.\n\n## Safety, Inclusivity and Accessibility\n\n- **Volume control:** Keep peaks below 95 dB; offer earplugs; provide a quiet area.\n- **Content filter:** Keep a “red list” of songs with slurs/explicit lyrics you don’t allow. Host retains veto rights.\n- **Photo consent:** Use wristbands or sticker system for guests who don’t want to be filmed; mention on the mic before filming.\n- **Accessibility:** Ensure lyric screens are visible from multiple angles; provide a printed lyrics option; create stage ramps or alternative performance spaces for wheelchair users.\n\n## Run-of-Show (120 Minutes)\n\n| Time | Segment | Detail |\n| --- | --- | --- |\n| 20:00–20:10 | Warm-up + sign-ups | Host sings one song, explains rules, pushes queue-skip bundle. |\n| 20:10–20:50 | Set 1 | 10–12 singers; mix confident regulars with first-timers. |\n| 20:50–21:00 | Break | Bar push (singer spritz, AF slushie), swap mic covers. |\n| 21:00–21:40 | Set 2 | Encourage duets, group songs, birthday serenades. |\n| 21:40–21:55 | “Greatest Hits” finale | Crowd-pleasers, audience singalongs, final prizes. |\n| 21:55–22:00 | Wrap | Thank-you, winners photo, tease next theme, invite bookings. |\n\n## Marketing Toolkit\n\n- **Visuals:** neon typography, mic silhouettes, lyric overlays.\n- **Content ideas:** Reel of crowd chorus (with consent), “Song of the Week” poll, behind-the-scenes soundcheck snippet.\n- **Copy-ready caption:** “Karaoke Friday, 8pm. Free to sing, prizes for biggest crowd reaction. Book a table or just rock up—link in bio.”\n- **Cross-promo:** plug Music Bingo 101 for midweek fun and Quiz Night 101 for trivia lovers.\n\n## Budget Snapshot\n\n| Cost centre | Range |\n| --- | --- |\n| Karaoke software subscription | £25–£50/month |\n| Mic upgrade/maintenance | £100–£250 each |\n| Lighting | £80–£200 |\n| Host fee (if freelance) | £150–£300/night |\n| Prize kitty | £50–£120 (tabs, merch, queue-skip vouchers) |\n\n## Compliance Corner: Music Licensing\n\nKaraoke involves both recorded backing tracks and live vocal performance. Most venues cover this via **TheMusicLicence** (PPL PRS), which bundles permissions from PRS for Music and PPL. Confirm your venue’s licence type covers karaoke/live events and keep evidence on file. More info: [PPL PRS live events](https://pplprs.co.uk/themusiclicence/sectors/live-events-festivals/).\n\n## FAQs\n\n**What’s the minimum equipment investment to start?** Budget £300–£600 for two decent dynamic mics, a small mixer/interface, karaoke software, and basic lighting; hire gear short-term if you need to prove ROI first.  \n**How do I keep the queue fair without annoying regulars?** Use a visible running order (TV/whiteboard) and rotate newcomers between established singers; cap it at one song per person per round.  \n**Do I need extra licences or insurance?** Karaoke falls under TheMusicLicence for most venues, but check your public liability insurance covers live participation and that your licence includes live/recorded music.  \n**How do I handle offensive or explicit lyric requests?** Keep a banned-song list, brief hosts to veto anything that breaches your safe-space policy, and offer clean alternatives.  \n**What’s my contingency if the tech fails mid-show?** Always have a wired backup mic, offline playlists, and a Bluetooth speaker ready so you can pivot to a singalong or playlist battle while troubleshooting.\n\n## Need backup?\n\nTap the sticky “Get in Touch” button on orangejelly.co.uk or email `peter@orangejelly.co.uk` for host training, tech setup walkthroughs, or a curated karaoke theme calendar tailored to your pub.\n",
      "summary": "Turn Thursdays into high-energy karaoke shows with the right kit, rotation rules, and compliance guardrails.",
      "date_published": "2025-10-23T00:00:00.000Z",
      "date_modified": "2025-11-06T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": ["karaoke night", "pub events", "licensee toolkit", "music compliance"],
      "image": "https://www.orangejelly.co.uk/images/blog/karaoke-night-101.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/delivery-click-collect-without-harm",
      "url": "https://www.orangejelly.co.uk/licensees-guide/delivery-click-collect-without-harm",
      "title": "Harnessing Delivery and Click & Collect Without Killing Service",
      "content_html": "\n# Harnessing Delivery and Click & Collect Without Killing Service\n\nDelivery can add revenue, but it can also crush the in-house experience if you let it run unchecked. The answer is not to drop the channel, it is to control it with a menu split, capacity cap, and clean handoff.\n\nThis is a practical system you can implement in a week.\n\n## Step 1: Separate menus by channel\n\nYour dine-in menu and delivery menu are not the same. Delivery needs:\n- Dishes that travel well.\n- Short prep time.\n- Strong margins after fees.\n\nCreate a short delivery menu and keep it stable for four weeks. It will lift consistency and ratings.\n\n## Step 2: Ringfence capacity\n\nDecide how many delivery orders you can handle per hour without hurting tables. Then cap it. Most platforms let you pause or throttle.\n\nIf you do not cap, the kitchen gets crushed, and everyone loses.\n\n## Step 3: Create a dispatch station\n\nBuild a clean, labeled area for packing, checks, and pickup. The person on dispatch is responsible for accuracy, extras, and timing.\n\nA single missed sauce can undo a good meal.\n\n## Step 4: Optimize collection flow\n\nClick and collect should be fast. Clear signage, a dedicated pick-up point, and a one-minute handover keeps it smooth.\n\nIf guests have to queue at the bar, you are creating friction.\n\n## Step 5: Track profit per channel\n\nCompare delivery margin to dine-in margin. If delivery is below your threshold, raise prices or reduce items. You are not here to sell at a loss.\n\n## Step 6: Cross-pollinate marketing\n\nUse delivery customers to build dine-in visits. Add a card in every bag: \"Show this and get priority booking.\" It is a simple bridge from takeout to table.\n\n## Example setup\n\n- Delivery menu: 10 items, all under 15 minutes prep.\n- Cap: 8 delivery orders per hour.\n- Dispatch: one staff member during peak hours.\n- Promotion: weekly post plus a dine-in invitation in every bag.\n\n## Common mistakes\n\n- Running the full menu on delivery.\n- Accepting unlimited orders at peak.\n- Letting delivery drivers crowd the bar.\n- Ignoring margin impact.\n\n## Quick checklist\n\n- Delivery menu shortened and costed.\n- Hourly order cap set.\n- Dispatch station in place.\n- Profit per channel reviewed weekly.\n\n## Mini FAQ\n\n**Should I offer discounts on delivery?**\nNot unless you can protect margin through pricing or bundling. Discounts rarely build loyalty on platforms.\n\n**How do I handle slow nights?**\nLift the cap slightly on quiet days, but keep the shorter menu and margin rules.\n",
      "summary": "Layer takeaway revenue on top of pub trade without wrecking the guest experience on-site.",
      "date_published": "2025-10-17T00:00:00.000Z",
      "date_modified": "2026-03-02T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": ["delivery", "click and collect", "operations", "guest experience", "systems"],
      "image": "https://www.orangejelly.co.uk/images/blog/delivery-click-collect-without-harm.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/family-craft-hour-101",
      "url": "https://www.orangejelly.co.uk/licensees-guide/family-craft-hour-101",
      "title": "Family Craft Hour 101: Licensee Guide",
      "content_html": "\n# Family Craft Hour 101: Safe Projects, Smooth Setups, Happy Families\n\nIf you want Sunday lunch bookings to grow, give parents something extra beyond roast potatoes. A structured craft hour keeps kids busy, reassures carers about safety, and fills quieter slots (10–11am, midday, or rainy half-term afternoons). Use this guide to plan projects, lay out the room, handle safeguarding and allergies, and promote the session.\n\n## Who It’s For and When to Run It\n\n- **Age range:** aim for 3–11 with a responsible adult per child. Offer a toddler-safe tray (chunky crayons, sticker sheets) so younger siblings aren’t left out.\n- **Timing:** weekend mornings (10–11am) before the roast rush, or weekday afternoons during school holidays. Cap sessions at 60–75 minutes to minimise fatigue.\n- **Booking model:** free with table reservation or £3–£5 per child including materials. Take pre-payments via your booking platform to reduce no-shows.\n\n## Project Menu\n\n| Theme | Activity | Mess level | Notes |\n| --- | --- | --- | --- |\n| Valentine’s/Mother’s Day | Card bar with stamps, dried petals, ribbon | Low | Pre-cut hearts, provide glue dots instead of wet glue. |\n| Easter | Foam egg decorating, bunny-ear headbands | Medium | Avoid glitter—use metallic stickers instead. |\n| Summer Holidays | DIY wind socks, beach-bottle sensory jars | Medium | Offer outdoor drying line. |\n| Halloween | Paper lanterns, upcycled costume props | Medium-high | Tablecloths + aprons essential. |\n| Christmas | Salt-dough ornaments (pre-baked), felt garlands | Medium | Air-dry overnight; provide boxes for transport. |\n\nPrepare at least two stations per session: one seated craft, one “make and take” quick win. Include an upcycle corner (scrap fabric, cereal boxes) to keep costs down and spark creativity.\n\n## Setup and Flow\n\n1. **Arrival (5 mins):** sign-in desk collects guardian contact, allergies, photography preference. Issue wristbands or stickers (green = photo OK, red = no photos).\n2. **Demo (5 mins):** facilitator shows finished sample and key steps.\n3. **Make time (40 mins):** staff circulate with positive prompts; capture quotes for socials (with consent).\n4. **Show-and-tell (5 mins):** quick parade or mini gallery.\n5. **Tidy + transition (5 mins):** bins, wipes, labelled bags for take-home crafts.\n\n> **Room map idea**  \n> Entry/sign-in desk → consent icons → hand sanitiser  \n> Station A (cut-and-stick) | Station B (colouring) | Station C (make & take)  \n> Quiet table | Buggy park | First-aid point | Wash-up bin\n\n## Materials and Sourcing\n\n- **Consumables:** child-safe scissors, PVA glue sticks, masking tape, pipe cleaners, foam shapes, stickers, googly eyes, washi tape, non-toxic paint pens.\n- **Surfaces:** wipe-clean cloths, kraft paper roll, clipboards for instructions.\n- **Suppliers:** look for UKCA/CE marks and EN 71 references on craft kits/toys to ensure compliance with the UK Toys (Safety) Regulations. ([GOV.UK guidance](https://www.gov.uk/government/publications/toys-safety-regulations-2011/toys-safety-regulations-2011-great-britain))\n- **Allergy control:** avoid latex balloons, nut-based materials, fragranced glues. Display ingredient lists for any playdough or edible treats.\n\n## Safeguarding and Photography\n\n- Maintain ratios (1 staff per 8 children recommended). All staff should know who the designated safeguarding lead is.\n- Keep a clearly signed “grown-ups must stay” policy—this isn’t a drop-off club.\n- For photos/videos, follow NSPCC guidance: explain how images will be used, obtain consent, and store footage securely. ([NSPCC Learning](https://learning.nspcc.org.uk/online-safety/photographing-filming-children))\n- First aid: have at least one paediatric first-aider on shift, stock plasters/eyewash, and log any incidents immediately.\n\n## Accessibility and Inclusion\n\n- Offer adaptive scissors, chunky brushes, and stabilising mats for children with motor challenges.\n- Provide visual step-by-step cards with icons and simple text.\n- Keep a sensory-friendly corner with noise-reducing headphones, fidgets, and storybooks.\n- Ensure tables are spaced for wheelchair access and prams.\n\n## Budget and Bundles\n\n| Item | Typical cost |\n| --- | --- |\n| Consumables per child | £1.50–£3.50 |\n| Reusable kit (aprons, trays) | £30–£80 |\n| Staff/facilitator hour | Standard FOH rate |\n| Prize draw (optional) | £5–£20 (book voucher, dessert) |\n\nPackage craft hour with dining offers: “Craft & Roast” (£14.95 kids roast + craft station + dessert) or “Makers Mocktail” for parents.\n\n## Marketing Playbook\n\n- **Channels:** school/PTA newsletters, local Facebook “Family Fun” groups, WhatsApp parents chats, community noticeboards.\n- **Messaging:** emphasise structured fun, all materials included, allergy-aware, booking essential.\n- **Copy-ready caption:** “Family Craft Hour this Saturday, 10–11am. Ages 3–11 with a grown-up. Material kits included, book your table 👉 [link].”\n- **Cross-links:** mention Family Craft Hour at the end of boardgame or quiz articles (“Looking for daytime fun? Try our craft hour.”)\n\n## Risk Management and House Rules\n\n- Display simple rules: walking feet, share tools, ask before using scissors, tidy your station.\n- Keep spill kits, bin bags, and cloths nearby; brief staff on immediate clean-up to prevent slips.\n- Store completed crafts away from hot surfaces and food areas.\n\n## Metrics to Track\n\n| KPI | Target |\n| --- | --- |\n| Families per session | Healthy turnout |\n| Average spend | Healthy per table (craft + food) |\n| Dessert add-on | Strong |\n| Next-event pre-book | Strong |\n\nUse a QR survey asking what themes families want next (Mother’s Day, World Book Day, etc.) and collect email opt-ins for future marketing.\n\n## FAQs\n\n**Do I need DBS checks for staff?** If the same team members regularly supervise children, DBS checks are strongly advised; at minimum have a named safeguarding lead and documented safer recruitment steps.  \n**How do I manage allergies without scaring parents off?** Collect allergy info at sign-in, avoid high-risk materials (nuts, latex), label ingredients on homemade doughs, and keep EPI-pen-aware staff nearby.  \n**How much buffer time should I allow for clean-up?** Build in a 15-minute reset after each session for wiping surfaces, restocking trays, and drying crafts before the lunch rush.  \n**Can I monetise take-home kits?** Yes—bundle leftover supplies into £5 “mini kits” or offer pre-booked premium packs (e.g., wreath making) for seasonal upsell.  \n**Do I need special insurance or risk assessments?** Review your public liability policy, complete an activity-specific risk assessment (tools, slips, choking hazards), and keep it on file with COSHH sheets for any paints/glues.\n\n## Need backup?\n\nTap the sticky “Get in Touch” button on orangejelly.co.uk or email `peter@orangejelly.co.uk` for help sourcing craft kits, writing risk assessments, or training a craft lead.\n",
      "summary": "A safeguarded Sunday playbook for running craft tables, card bars, and seasonal trails that fill the dining room.",
      "date_published": "2025-10-16T00:00:00.000Z",
      "date_modified": "2025-11-06T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": ["family pub ideas", "craft hour", "licensee guide", "sunday trade"],
      "image": "https://www.orangejelly.co.uk/images/blog/family-craft-hour-101.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/crisis-pr-landlords-bad-reviews",
      "url": "https://www.orangejelly.co.uk/licensees-guide/crisis-pr-landlords-bad-reviews",
      "title": "Crisis PR for Landlords: Turning Bad Reviews into Bookings",
      "content_html": "\n# Crisis PR for Landlords: Turning Bad Reviews into Bookings\n\nA brutal review can kill bookings in hours. The fix is not defensiveness, it is speed, transparency, and a public recovery plan. The response is part of the marketing now, because future guests read how you handle mistakes.\n\nThis is a practical protocol you can follow every time a review goes nuclear.\n\n## Step 1: Capture and calm\n\nScreenshot the review and share it internally. Do not reply in anger. Give yourself a short pause so you can respond with control, not ego.\n\n## Step 2: Respond within 12 hours\n\nSpeed matters. A clear, calm response reduces damage and signals accountability.\n\nExample response:\n\"Hi Jamie, thanks for sharing this. I am genuinely sorry your visit fell short. I have spoken to the team and we are fixing the issues you raised. If you are open to it, please email me directly so I can make this right. Peter.\"\n\nKeep it short. Own the issue. Offer a path to resolution.\n\n## Step 3: Investigate fast and publicly\n\nFind the root cause. Was it a staffing gap, a supplier issue, or a process failure? Once you know, explain the fix in public language.\n\nExample:\n\"We were short in the kitchen that night and let orders stack up. We have now added a second cook on Saturdays and shortened the menu during peak service.\"\n\n## Step 4: Close the loop with the reviewer\n\nIf they respond, make it right. A corrected mistake can become a loyal regular. Use a clear offer and a friendly tone.\n\n- Invite them back with a specific time.\n- Give a small but meaningful gesture (a round, a dessert, a table reservation).\n\n## Step 5: Flood the feed with fresh proof\n\nThe fastest way to bury a bad review is to earn ten good ones. Ask happy guests for reviews for two weeks. Make it part of the service routine.\n\nSimple script: \"If you had a good time tonight, a quick review helps local pubs like ours more than you would believe.\"\n\n## Step 6: Publish the comeback\n\nShare a short update on socials or your website about the fix. Not defensive, just transparent.\n\nExample:\n\"We heard your feedback about slow service last weekend. We have added another team member on Saturdays and tightened the menu for faster delivery. Thank you for pushing us to improve.\"\n\n## Common mistakes\n\n- Arguing with the reviewer.\n- Writing a long essay response.\n- Ignoring reviews for days.\n- Promising fixes you do not implement.\n\n## Quick checklist\n\n- Respond in under 12 hours.\n- Confirm the root cause within 24 hours.\n- Publish the fix publicly.\n- Request reviews from happy guests for two weeks.\n\n## Mini FAQ\n\n**Should I offer a refund publicly?**\nOffer a private resolution. Public refunds can encourage repeat complaints.\n\n**What if the review is fake?**\nRespond politely, state you cannot find a record, and invite them to contact you directly.\n",
      "summary": "A practical protocol for handling brutal reviews, correcting the issue, and showing the public how you fixed it.",
      "date_published": "2025-10-10T00:00:00.000Z",
      "date_modified": "2026-02-09T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": ["PR", "reviews", "reputation", "customer service", "communications"],
      "image": "https://www.orangejelly.co.uk/images/blog/crisis-pr-landlords-bad-reviews.png"
    },
    {
      "id": "https://www.orangejelly.co.uk/licensees-guide/cash-bingo-101",
      "url": "https://www.orangejelly.co.uk/licensees-guide/cash-bingo-101",
      "title": "Cash Bingo 101: Licensee Guide",
      "content_html": "\n# Cash Bingo 101: Responsible Formats, Smooth Operations, Happy Players\n\nCash bingo is pure nostalgia: dabbers in hand, friends cheering, and prizes that feel achievable. It’s also regulated, so this guide balances fun with the key compliance steps UK pubs must follow. Treat it as planning guidance—not legal advice—and always check the latest Gambling Commission and local authority rules before you advertise or accept money.\n\n## Quick Compliance Snapshot\n\n- Bingo in alcohol-licensed premises can usually run as **exempt equal-chance gaming** without a Gambling Commission operating licence—as long as you stay within stake/prize limits and follow the conditions. ([Gambling Commission](https://www.gamblingcommission.gov.uk/licensees-and-businesses/guide/page/exempt-gaming-in-pubs))\n- Maximum stakes: no more than £5 per person per game.\n- Combined stakes/prizes from bingo must not exceed £2,000 within any seven-day period; if you go over you must obtain the relevant bingo operating licence.\n- No participation fees—charge for books/tickets only.\n- Keep clear records of takings and payouts, and display house rules plus responsible gambling information.\n\n## Know Your Format: 90-ball Bingo\n\nUK pubs typically run 90-ball bingo:\n\n- Tickets are 3 rows × 9 columns, 15 numbers per ticket.\n- Wins: one line, two lines, full house.\n- Each strip/book contains six tickets covering numbers 1–90.\n\nIf you do something different (75-ball US-style cards, themed variations), explain it clearly at the start and note whether it fits exempt gaming rules.\n\n## Kit and Setup\n\n| Item | Purpose | Tip |\n| --- | --- | --- |\n| Bingo machine/cage or digital randomiser | Draws numbers | Test before doors; keep a spare set of balls. |\n| Caller’s book + number board | Tracking draws | Visible board helps reduce disputes. |\n| Tickets/books + dabbers | Player materials | Colour-code per game for clarity. |\n| PA/mic | Ensure numbers are heard | Keep volume just above background chatter. |\n| Float + cash box | Manage book sales | Two staff sign off at start and finish. |\n| Winners log | Compliance trail | Record name/team, prize, time. |\n\n## Money Handling and Payout Models\n\n- **Pricing:** e.g., £1 per single strip, £3 per book of three games, £10 “night pass” including snack or drink.\n- **Payout:** publish a simple table such as £10 for one line, £20 for two lines, £40 for full house in each of the first four games, then end with a £50 full-house jackpot.\n- **Float reconciliation:** use a cash sheet noting start float, books sold, total sales, payouts, end float, variance explanation.\n\n> **Cash reconciliation template**  \n> Start float £____  \n> Books sold ___ @ £___ = £____  \n> Single tickets ___ @ £___ = £____  \n> Total sales £____  \n> Prizes paid £____  \n> End float £____  \n> Over/under £____ (explain variance)  \n> Signed: Seller ___ / Manager ___\n\n## Hosting and Pace\n\n- **Caller style:** clear diction, consistent tempo (~1 number every 3–4 seconds). Use traditional call phrases (“Two little ducks – 22”) sparingly unless the crowd expects them.\n- **Verification:** when someone shouts, pause the draw, have the runner check the card against the caller’s master ticket, then announce “All verified!” before resuming.\n- **Tie-breaks:** either split the prize or run a rapid-fire bonus question. Publish the policy beforehand.\n\n## Responsible Play and Safeguarding\n\n- Challenge 25 signage and trained staff for age checks (bingo participation is 18+).\n- “Keep it fun” messaging on posters and tables; display links to support services (GamCare, BeGambleAware).\n- Allow players to self-exclude from future nights if needed; log any requests confidentially.\n- Watch alcohol intake—refuse sales to intoxicated guests who want to carry on playing.\n\n## Run-of-Show (120 Minutes)\n\n| Time | Action |\n| --- | --- |\n| 19:00–19:15 | Doors open, sell books, explain prices and prizes |\n| 19:15–19:45 | Games 1–3 (1 line / 2 lines / full house each) |\n| 19:45–20:00 | Break, snack upsell, social posts |\n| 20:00–20:30 | Games 4–6 |\n| 20:30–20:55 | Final “big” game |\n| 20:55–21:00 | Prize settlement, float sign-off, thank-yous |\n\n## Marketing (Responsibly)\n\n- Focus messaging on community, atmosphere, and bundles—not guaranteed winnings.\n- Channels: in-house posters, Facebook “What’s On” groups, pensioner lunch leaflets, WhatsApp broadcast to regulars.\n- **Copy-ready caption:** “Cash Bingo this Thursday, eyes down 7.15pm 👀 Books from £1, prizes every game, Challenge 25 in operation. Reserve a table: [link].”\n\n## Budget Snapshot\n\n| Expense | Range |\n| --- | --- |\n| Bingo machine/board | £100–£400 purchase or hire |\n| Tickets/dabbers | £15–£40 per 100 players |\n| Prize kitty | Depends on entries (publish percentages) |\n| Staff hours | Caller + verifier + FOH |\n\n## Compliance Signposts (UK)\n\n- [Gambling Commission – Exempt gaming in pubs](https://www.gamblingcommission.gov.uk/licensees-and-businesses/guide/page/exempt-gaming-in-pubs)\n- [Gambling Commission – Bingo in clubs/alcohol-licensed premises](https://www.gamblingcommission.gov.uk/guidance/guidance-to-licensing-authorities/part-18-bingo-in-clubs-and-alcohol-licensed-premises)\n- Check your local authority (e.g., [Breckland Council](https://www.breckland.gov.uk/article/14779/Pubs-and-Other-Alcohol-Licensed-Premises)) for any additional notice requirements.\n\nAlways log conversations with licensing officers and keep a folder containing: house rules, float sheets, winners logs, promotional materials, and proof of staff training.\n\n## Metrics to Track\n\n| KPI | Target |\n| --- | --- |\n| Books sold | High share of capacity |\n| Night pass uptake | Strong |\n| Average spend per head | Healthy |\n| Repeat attendance (4 weeks) | Strong |\n\nDebrief the next day: Did any rules confuse people? Were payouts smooth? Do we need more dabbers? Capture feedback before the next session.\n\n## FAQs\n\n**Do I need a Gambling Commission licence to run bingo?** Not if you stay within the exempt equal-chance gaming rules (stakes ≤ £5/person/game and <£2,000 combined stakes/prizes over seven days) but you must document compliance.  \n**How do I ensure I never exceed the £2,000 weekly limit?** Keep a running spreadsheet of every night’s takings and payouts; once you approach £1,600 pause cash bingo or switch to prize-based games until the rolling seven-day window resets.  \n**What pricing structure works best?** Sell books rather than single tickets (£3 per book, £10 “night pass”) and publish exactly what each prize tier pays to avoid disputes.  \n**How do I handle claims or disputes professionally?** Have a written protocol: pause calling, verify against the master sheet, record the outcome in the winners log, and communicate calmly over the mic.  \n**Can I combine cash bingo with charity fundraising?** Yes—just keep charitable donations ring-fenced from stake money and be transparent about which games are for charity vs standard payout.\n\n## Need backup?\n\nUse the sticky “Get in Touch” button on orangejelly.co.uk or email `peter@orangejelly.co.uk` if you want a compliance double-check, caller training, or bespoke prizes sourced for your venue.\n",
      "summary": "Keep Thursday nights lively with a compliant bingo format that respects Gambling Act rules, protects your float, and delights locals.",
      "date_published": "2025-10-09T00:00:00.000Z",
      "date_modified": "2025-11-06T00:00:00.000Z",
      "author": {
        "name": "Peter Pitcher",
        "email": "peter@orangejelly.co.uk"
      },
      "tags": ["cash bingo", "pub gaming compliance", "midweek toolkit", "licensee guide"],
      "image": "https://www.orangejelly.co.uk/images/blog/cash-bingo-101.png"
    }
  ]
}
